[
  {
    "nct_id": "NCT06330480",
    "title": "Check@Home: General Population Screening for Early Detection of Atrial Fibrillation and Chronic Kidney Disease",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 17,
      "keywords_found": [
        "type 2",
        "kidney"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* aged between 50 and 75 years\n* living in the selected regions (Breda, Utrecht, Arnhem, Eindhoven)\n\nExclusion Criteria:\n\n* age \\<50 years or \\>75 years\n* not living in the selected regions (Breda, Utrecht, Arnhem, Eindhoven)\n* being institutionalized (e.g., subjects with intellectual disabilities or subjects living in nursing homes who have a limited life expectancy)\n* participants of the previously conducted THOMAS Study (NL65228.042.18, METc 2018/687) will be excluded.",
      "sex": "ALL",
      "minimum_age": "50 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 50 and 75 years old?",
        "Do you live in Breda?",
        "Do you live in Utrecht?",
        "Do you live in Arnhem?",
        "Do you live in Eindhoven?"
      ],
      "exclusion": [
        "Are you younger than 50 years old?",
        "Are you older than 75 years old?",
        "Do you live in a nursing home or assisted living facility?",
        "Have you participated in the THOMAS Study before?"
      ]
    }
  },
  {
    "nct_id": "NCT03761446",
    "title": "The Role of Type 2 Diabetes on Skeletal Muscle Atrophy and Recovery Following Bed Rest in Older Adults",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 11,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria\n\n1. Participant must be male or female between the ages of 60 and 80 years of age.\n2. Participant has pre-diabetes or type 2 diabetes and is only taking DPP-4 inhibitors, Sulfonylureas and/or Metformin therapy (but not Insulin, injectable incretin mimeticsSGL2 inhibitors, and Thiazolidinedione's), and has an A1C \\< 8.0.\n\n   1. Pre-Diabetics are defined as having an HgbA1c of greater than or equal to 5.7% and less 6.5%, or a fasting glucose of greater than or equal to 100 mg/dl and less than 126 mg/dl or has a glucose of greater than or equal to 140 mg/dl and less than 200mg/dl at the 2 hour blood draw during OGTT\n   2. The non-diabetic control group is defined as having an HgbA1c of less than 5.7%, a fasting glucose of less than 100 mg/dl and a glucose level less than 140 mg/dl at the 2hr blood draw during the OGTT.\n3. Participant must have renal function with an estimated glomerular filtration rate (eGFR) \\> 45 ml/min/1.73m2 determined at screening.\n4. Participant's triglyceride level is \\< 350 mg/dl and LDL cholesterol is ≤ 150 mg/dl at screening.\n5. Participants must be non-smokers. Non-smokers as defined by not smoking any tobacco or using nicotine-containing products and not using vape pens or vaporizers within 3 months prior to screening.\n6. Participant states willingness to follow protocol as described, including consumption of study product per protocol, the prescribed activity level and completing any forms needed throughout the study.\n7. Participant has voluntarily signed and dated an informed consent form, approved by an Institutional Review Board/Independent Ethics Committee, and provided Health Insurance Portability and Accountability Act authorization (HIPAA) or other privacy authorization prior to any participation in study.\n\nExclusion Criteria\n\n1. Participant has type 1 Diabetes.\n2. BMI \\> 40.0 kg/m2\n3. Participant is actively pursuing weight loss and/or lifestyle changes.\n4. Participant has a history of pressure ulcers.\n5. Participant has a stated history of Deep Vein Thrombosis (DVT), pulmonary embolism, or a known hypercoagulable condition, or other clotting or bleeding disorders.\n6. History of gastrointestinal or intracranial hemorrhage.\n7. History of stroke or cerebrovascular accident.\n8. Recent history of major trauma (within 3 months).\n9. Thrombocytopenia (of any cause) or hyperkalemia (K \\> 5.0) on screening laboratory assay. May repeat lab value per PI discretion.\n10. Untreated or poorly controlled hypertension (SBP \\> 150, DBP \\> 95), or hypotension (SBP \\<100 DBP \\<60)\n11. Participant has a TSH greater than or equal to 10mIU/L.\n12. Participant has current infection (requiring prescription antimicrobial or antiviral medication, or hospitalization), or corticosteroid treatment (with the exception of inhaled or topical steroids) in the last 3 months prior to screening visit.\n13. Participant is currently taking anti-inflammatory medication or has anti-inflammatory medication in the 1 weeks prior to screening (including over the counter formulations; e.g. Aleve, Motrin, ibuprofen, naproxen).\n14. Participant has had surgery requiring \\> 2 days of hospitalization in the last 1 month prior to screening visit.\n15. Participant has an active malignancy or autoimmune disease.\n16. Participant has current significantly impaired liver function in the opinion of the study PI (mild asymptomatic fatty liver is acceptable), or hepatic enzyme tests are ≥ 2.5 times normal limit.\n17. Participant has a chronic, contagious, infectious disease, such as active tuberculosis, Hepatitis B or C, or HIV.\n18. Participant is an amputee and/or has presence of partial or full artificial limb.\n19. Participant has had a significant cardiovascular event (e.g. myocardial infarction, stroke) ≤ 6 months prior to screening visit; or stated history of congestive heart failure; or participant has evidence of cardiovascular disease assessed during the ECG at screening. In the event of a positive stress test, participants are referred to their primary care physician. If the electrocardiogram (ECG) is determined to be a false positive, participant may be allowed to participate in study after confirmatory records obtained.\n20. Participant has a history of, or currently has uncontrolled severe diarrhea, nausea or vomiting.\n21. Participant has an obstruction of the gastrointestinal tract, inflammatory bowel disease, short bowel syndrome or other forms of gastrointestinal disease such as stage III or above gastroesophageal reflux disease, gastroparesis, peptic ulcer disease, celiac disease, intestinal dysmotility, diverticulitis, ischemic colitis and bariatric surgery.\n22. Participant cannot abstain from alcohol for the pre bed rest and bed rest portion of the study. For the recovery portion of the study the participant must agree to consume no more than 1 glass of wine (4-5 oz) or bottle of beer (12 oz) /day.\n23. Participant cannot refrain from taking medications/dietary supplements/herbals or substances that could modulate glucose metabolism (other than oral hypoglycemic medications), or are considered anabolic, or reduce weight (fat mass), or that may interact with low-molecular weight heparin or induce hypo- or hyper-coagulable state, in the opinion of the PI or medical provider, starting one week prior to enrollment and over the entire course of the study. These include progestational agents (except prescribed birth control), steroids, growth hormone, dronabinol, marijuana, calcium-beta-hydroxy-betamethylbutyrate (CaHMB), free amino acid supplements and dietary supplements to aid weight loss.\n24. Participant has a mini-Mental State Examination score \\< 21.\n25. Subjects who fulfill any of the contraindications for MRI; examples include metal implants, devices, paramagnetic objects contained within the body and excessive or metal-containing tattoos.\n26. Unable to participate in MR or DEXA assessments due to physical limitations of equipment tolerances (e.g., MRI bore size and DEXA 450-pound weight limit) claustrophobia, or based on Investigator's judgment at screening.\n27. Participant has a sensitivity or allergy to lidocaine.\n28. Participant has a sensitivity or allergy to heparin, enoxaparin, or other low molecular weight heparin.\n29. History of allergy to pork products or any component of the formulation of low-molecular weight heparin for dosing.\n30. History of heparin induced thrombocytopenia.\n31. Hemoglobin \\< 10.0 g/dL for females; \\< 11.0 g/dL for males; or participant has clinically significant signs/symptoms of anemia in the opinion of the PI or medical provider.\n32. Concomitant medications with known contraindication or interaction with low-molecular weight heparin (including anti-platelet agents, anti-coagulant agents, non-steroidal anti-inflammatory drugs)\n33. Presence of any condition that, in the opinion of the Investigator, compromises participant safety or data integrity or the participant's ability to complete the study.\n34. Participant experiences symptoms of claudication. Symptoms include cramping pain in the legs and/or difficulty walking.",
      "sex": "ALL",
      "minimum_age": "60 Years",
      "maximum_age": "80 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 60 and 80 years old?",
        "Do you have pre-diabetes or type 2 diabetes?",
        "Are you taking only DPP-4 inhibitors, Sulfonylureas, and/or Metformin for diabetes?",
        "Is your A1C less than 8.0?",
        "Is your kidney function normal with eGFR greater than 45?",
        "Is your triglyceride level less than 350 mg/dl?",
        "Is your LDL cholesterol 150 mg/dl or less?",
        "Have you avoided smoking or nicotine products for the last 3 months?",
        "Are you willing to follow the study's protocol and activity level?",
        "Have you signed the informed consent form?"
      ],
      "exclusion": [
        "Do you have type 1 diabetes?",
        "Is your BMI greater than 40?",
        "Are you currently trying to lose weight or change your lifestyle?",
        "Have you ever had pressure ulcers?",
        "Have you ever had deep vein thrombosis or pulmonary embolism?",
        "Have you ever had a stroke?",
        "Have you had major trauma in the last 3 months?",
        "Do you have untreated or poorly controlled high blood pressure?",
        "Are you currently taking anti-inflammatory medication?",
        "Have you had surgery requiring more than 2 days of hospitalization in the last month?"
      ]
    }
  },
  {
    "nct_id": "NCT06896799",
    "title": "Determining the Effect of Food Ordering on Blood Glucose In Gestational Diabetes Mellitus (DEFI-GDM) - a Randomised Crossover Study",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Pregnant women with gestational diabetes mellitus\n* Aged 18-50 years old\n\nExclusion Criteria:\n\n* History of type 1 or type 2 diabetes mellitus\n* Dietary restrictions or clinically confirmed food allergies that may affect study requirements\n* Pharmacologically managed GDM at the point of study entry\n* Hyperemesis gravidarum at the point of study entry (i.e. prolonged/severe nausea and vomiting)\n* Using antiemetic medication (e.g. dimenhydrinate, prochlorperazine, promethazine)\n* Any other problems or medical conditions that would substantially limit their ability to complete the study requirements\n\nParticipants can be recruited onto the study if they have previously had GDM in another pregnancy. Participants can also be recruited if they are involved in other research studies, but this will depend on the study type and the decision will be made by the Chief/Principal Investigator.",
      "sex": "FEMALE",
      "minimum_age": "18 Years",
      "maximum_age": "50 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you pregnant?",
        "Have you been diagnosed with gestational diabetes mellitus?",
        "Are you between 18 and 50 years old?"
      ],
      "exclusion": [
        "Have you ever been diagnosed with type 1 or type 2 diabetes mellitus?",
        "Do you have dietary restrictions or confirmed food allergies?",
        "Are you currently taking medication to manage gestational diabetes?",
        "Have you experienced prolonged or severe nausea and vomiting during pregnancy?",
        "Are you currently taking medication to prevent nausea or vomiting?",
        "Do you have any other medical conditions that would limit your ability to complete the study?"
      ]
    }
  }
]