[
  {
    "nct_id": "NCT06532682",
    "title": "Efficacy and Mechanism of Dapagliflozin Combined With Insulin in the Treatment of Early Diabetic Nephropathy in Patients With Type 1 Diabetes",
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Age between 18 and 65 years;\n* Diagnosed with type 1 diabetes mellitus with a disease duration of more than 5 years;\n* Glycated hemoglobin (HbA1c) ≤ 7.5% at screening;\n* Diagnosed with diabetic nephropathy;\n* UACR between 30 and 300 and eGFR ≥ 60 ml/min/1.73 m².\n\nExclusion Criteria:\n\n* Other types of diabetes;\n* Use of any antidiabetic medications (excluding insulin) within 1 month prior to screening;\n* History of diabetic ketoacidosis within 3 months prior to screening, or a diagnosed episode of diabetic ketoacidosis within the past 1 month;\n* History of poor blood glucose control requiring hospitalization (due to hyperglycemia or hypoglycemia) within 1 month prior to screening;\n* Frequent severe hypoglycemia or unconscious hypoglycemia (more than once requiring medical intervention or emergency care) within 1 month prior to screening;\n* Use of SGLT2 inhibitors or other renal protective medications within 6 months prior to screening;\n* Women who are planning to become pregnant, pregnant, or breastfeeding;\n* Cardiovascular disease (within 6 months prior to screening);\n* Unstable/rapidly progressing renal disease (within 6 months prior to screening), or renal artery stenosis;\n* Major liver disease or malignant tumors (within 5 years prior to screening).",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "65 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 65 years old?",
        "Have you been diagnosed with type 1 diabetes for more than 5 years?",
        "Is your glycated hemoglobin (HbA1c) level 7.5% or less?",
        "Have you been diagnosed with diabetic nephropathy?",
        "Is your urine albumin-to-creatinine ratio (UACR) between 30 and 300 and your eGFR 60 or higher?"
      ],
      "exclusion": [
        "Do you have any type of diabetes other than type 1?",
        "Have you used any antidiabetic medications other than insulin in the last month?",
        "Have you had diabetic ketoacidosis in the last 3 months?",
        "Have you been hospitalized for poor blood sugar control in the last month?",
        "Have you had severe hypoglycemia more than once in the last month?",
        "Have you used SGLT2 inhibitors or other renal protective medications in the last 6 months?",
        "Are you planning to become pregnant, pregnant, or breastfeeding?",
        "Have you had any cardiovascular disease in the last 6 months?",
        "Do you have unstable or rapidly progressing kidney disease or renal artery stenosis?",
        "Have you had major liver disease or malignant tumors in the last 5 years?"
      ]
    }
  },
  {
    "nct_id": "NCT06218342",
    "title": "The Study of Henagliflozin in Relieving Progression of Type 2 Diabetes With Non-alcoholic Fatty Liver Disease",
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Age between 20 and 70 years old.\n* Diagnosed with type 2 diabetes according to World Health Organization (WHO) diagnostic criteria, with evidence of fatty liver on ultrasound, and FIB-4 index \\>1.3.\n* Willing to participate in this study and sign an informed consent form. In case the subject lacks the ability to read the informed consent form (e.g., illiterate subjects), the informed process must be witnessed by a designated person who will sign the informed consent form.\n* Have not used oral antidiabetic medications or have used one to three oral antidiabetic medications (limited to metformin, Dipeptidyl peptidase-4 (DPP-4) inhibitors, alpha-glucosidase inhibitors, or sulfonylureas) with an HbA1c between 7% and 10%, and fasting venous blood glucose ≤13.3 mmol/L.\n* Have not used thiazolidinediones (TZDs), sodium-glucose co-transporter-2 inhibitors (SGLT-2i), glucagon-like peptide-1 receptor agonists (GLP-1RA), or other antidiabetic drugs that may affect liver fat content in the last 90 days.\n* Weight change of less than 5% in the last 3 months.\n* If of childbearing age, must use reliable contraceptive measures.\n\nExclusion Criteria:\n\n* Daily alcohol intake of \\>30 g in the past 10 years or daily alcohol intake of \\>10 g in the last year.\n* History of liver diseases such as hepatitis B, chronic hepatitis C, primary biliary cholangitis (PBC), biliary obstruction disorders, drug-induced liver damage, hemochromatosis, liver cirrhosis, autoimmune hepatitis.\n* Patients with decompensated liver cirrhosis, concurrent liver cancer, HIV-positive status, or substance abuse.\n* Type 1 diabetes.\n* Participation in other clinical trials of diabetes treatment drugs in the 3 months prior to the start of this study.\n* Occurrence of diabetic ketoacidosis, diabetic lactic acidosis, or hyperosmolar non-ketotic coma in the past 6 months.\n* Occurrence of unexplained severe hypoglycemic events in the past 6 months (requiring assistance for recovery) or recurrent hypoglycemia: such as experiencing two or more low blood sugar events (blood glucose ≤3.9 mmol/L) in the month before screening.\n* Severe heart disease patients, such as New York Heart Association (NYHA) class IV, unstable angina, or history of myocardial infarction.\n* Abnormal liver function, with alanine aminotransferase (ALT) or aspartate aminotransferase (AST) levels greater than 3 times the upper normal limit, or total bilirubin (TBIL) greater than 2 times the upper normal limit.\n* Chronic kidney damage, with a creatinine level (Cr) \\>200 µmol/L or an estimated glomerular filtration rate (eGFR) \\<30 mL·min-1.\n* Use of corticosteroid medications (excluding short-term topical or inhaled use).\n* Patients with malignant tumors, active tuberculosis, or acute/chronic infections.\n* Vulnerable populations, including pregnant women, individuals with mental illness, critically ill patients, individuals with cognitive impairments, etc.\n* History of recurrent urinary tract infections or genital infections, or allergies to the investigational drug or its components.\n* Patients assessed by the clinical doctor as having low blood volume.\n* Patients deemed unsuitable for participation in this clinical study by the investigator, for reasons not covered above.",
      "sex": "ALL",
      "minimum_age": "20 Years",
      "maximum_age": "70 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 20 and 70 years old?",
        "Have you been diagnosed with type 2 diabetes and fatty liver?",
        "Are you willing to participate in this study and sign a consent form?",
        "Have you used no more than three oral antidiabetic medications?",
        "Is your HbA1c between 7% and 10%?",
        "Is your fasting blood sugar level less than or equal to 13.3 mmol/L?",
        "Have you not used specific antidiabetic drugs in the last 90 days?",
        "Has your weight changed less than 5% in the last 3 months?",
        "Are you using reliable contraceptive measures if you can have children?"
      ],
      "exclusion": [
        "Do you drink more than 30g of alcohol daily in the past 10 years?",
        "Do you drink more than 10g of alcohol daily in the last year?",
        "Have you had liver diseases like hepatitis B or C?",
        "Do you have liver cirrhosis or liver cancer?",
        "Are you HIV-positive or have a history of substance abuse?",
        "Have you been diagnosed with type 1 diabetes?",
        "Have you participated in other diabetes drug trials in the last 3 months?",
        "Have you had diabetic ketoacidosis or severe hypoglycemia in the past 6 months?",
        "Do you have severe heart disease or history of myocardial infarction?",
        "Do you have abnormal liver function with high ALT or AST levels?",
        "Do you have chronic kidney damage with high creatinine levels?",
        "Are you using corticosteroid medications regularly?",
        "Do you have malignant tumors, active tuberculosis, or chronic infections?",
        "Are you pregnant, mentally ill, critically ill, or cognitively impaired?",
        "Have you had recurrent urinary tract infections or allergies to the study drug?",
        "Have you been assessed as having low blood volume?",
        "Have you been deemed unsuitable for this study by the investigator?"
      ]
    }
  },
  {
    "nct_id": "NCT05801614",
    "title": "Normalized Glucose Levels in Type 2 Diabetes With Carbohydrate or Caloric Restriction: a Randomized Controlled Trial (CarborCal)",
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* HbA1c \\> 48 mmol/mol (with or without medical treatment);\n* less than 6 years since the diagnosis of T2D\n* BMI ≥ 27 kg/m2 (≥ 25 kg/m2 for Asians).\n\nExclusion Criteria:\n\n* Insulin deficiency.\n* HbA1c concentration of 12% or more (≥108 mmol/mol),\n* treatment with sulphonyl urea or sodium-glucose-cotrasporter2-inhibitor (SGL2-i),\n* myocardial infarction within the previous 6 months,\n* severe or unstable heart failure\n* other severe diseases including cancer, psychiatric/eating disorders, severe depression - substance abuse,\n* conditions that may affect the ability of patients to participate in the study",
      "sex": "ALL",
      "minimum_age": "24 Years",
      "maximum_age": "70 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Is your HbA1c level greater than 48 mmol/mol?",
        "Have you been diagnosed with type 2 diabetes in the last 6 years?",
        "Is your BMI 27 or higher? (25 or higher if you are Asian)"
      ],
      "exclusion": [
        "Do you have insulin deficiency?",
        "Is your HbA1c level 12% or more?",
        "Are you being treated with sulphonyl urea or SGL2 inhibitors?",
        "Have you had a heart attack in the last 6 months?",
        "Do you have severe or unstable heart failure?",
        "Have you been diagnosed with cancer?",
        "Have you been diagnosed with a psychiatric or eating disorder?",
        "Have you been diagnosed with severe depression?",
        "Have you struggled with substance abuse?",
        "Do you have any condition that may affect your ability to participate in this study?"
      ]
    }
  },
  {
    "nct_id": "NCT06826235",
    "title": "Tip 2 Diyabetli Yetişkin Bireylerde Hurma Tüketiminin Hedonik Açlık ve İştah Hormonları Üzerine Etkilerinin İncelenmesi",
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Individuals diagnosed with Type 2 diabetes aged 19-50 years (excluding menopausal women),\n* Individuals with BMI between 25-35 kg/m2,\n* Individuals with a Nutritional Strength Scale score of 2.5 and above,\n* Individuals who agreed not to start taking new dietary supplements or alternative therapies during the study period,\n* Individuals who agree not to change their current physical activity level and diet.\n\nExclusion Criteria:\n\n* Individuals who do not approve the volunteer consent form,\n* Individuals with a Nutritional Strength Scale score below 2.5,\n* Pregnant or breastfeeding women (or women planning to become pregnant within 3 months)\n* Individuals with dietary energy \\<800 kcal/day and \\>4000 kcal/day,\n* Individuals with pre-diabetes, type 1 diabetes and gestational diabetes,\n* Individuals with HbA1c \\>10\n* Individuals taking antibiotics or hormone replacement therapy History of malignancy (except non-melanoma skin cancer).\n* Individuals with regular consumption of dates before inclusion in the study,\n* Individuals diagnosed with Type 2 diabetes using insulin and oral antidiabetic drugs with thiazolidinedione active substance,\n* Individuals with a history of diabetic ketoacidosis, diabetic coma or precoma within 6 months prior to the date of admission; serious infections, surgery, serious trauma requiring insulin treatment, haemodialysis treatment (including peritoneal haemodialysis), serious liver injury and serious vascular complications (stroke, myocardial infarction and heart failure) requiring hospitalisation,\n* Individuals taking pharmacological agents that have effects on appetite such as psychotropics, antiepileptics, antidepressants, antipsychotics and/or steroids,\n* Individuals diagnosed with eating disorders and/or psychological disorders,\n* Individuals with physical illnesses that affect eating behaviour or appetite, such as uncontrolled hyperthyroidism or hypothyroidism, Cushing's disease, acromegaly, adrenal insufficiency, chronic renal failure (stage 4 or 5), tuberculosis, human immunodeficiency virus (HIV) infection.",
      "sex": "ALL",
      "minimum_age": "19 Years",
      "maximum_age": "50 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with Type 2 diabetes?",
        "Are you between 19 and 50 years old?",
        "Are you a woman who is not going through menopause?",
        "Is your BMI between 25 and 35?",
        "Is your Nutritional Strength Scale score 2.5 or above?",
        "Do you agree not to start new dietary supplements during the study?",
        "Do you agree not to change your current physical activity level and diet?"
      ],
      "exclusion": [
        "Do you disapprove the volunteer consent form?",
        "Is your Nutritional Strength Scale score below 2.5?",
        "Are you pregnant, breastfeeding, or planning to become pregnant in the next 3 months?",
        "Is your daily dietary energy less than 800 kcal or more than 4000 kcal?",
        "Have you been diagnosed with pre-diabetes, type 1 diabetes, or gestational diabetes?",
        "Is your HbA1c level greater than 10?",
        "Are you taking antibiotics or hormone replacement therapy?",
        "Have you ever been diagnosed with cancer, except non-melanoma skin cancer?",
        "Do you regularly consume dates?",
        "Are you taking insulin or oral antidiabetic drugs with thiazolidinedione?",
        "Have you had diabetic ketoacidosis, diabetic coma, or serious infections in the last 6 months?",
        "Have you had surgery or serious trauma requiring insulin treatment?",
        "Are you undergoing haemodialysis treatment?",
        "Have you had serious liver injury or serious vascular complications requiring hospitalization?",
        "Are you taking medications that affect appetite, such as psychotropics or steroids?",
        "Have you been diagnosed with an eating disorder or psychological disorder?",
        "Do you have physical illnesses that affect eating behavior or appetite, such as thyroid problems or chronic renal failure?",
        "Have you been diagnosed with tuberculosis or HIV infection?"
      ]
    }
  },
  {
    "nct_id": "NCT06925217",
    "title": "The Effect of Fully Closed-loop Insulin Delivery on Renal Oxygenation in People With Type 2 Diabetes and Chronic Kidney Disease: an Open-label, Single-center, Randomized Two-arm Parallel Trial",
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Age 18 years and older\n* Type 2 diabetes diagnosed for at least 12 months\n* Treatment with insulin therapy for at least 6 months\n* Stage 3 CKD (eGFR 30-59 ml/min/1.73m²) for at least 6 months\n* HbA1c \\< 12% based on venous blood sample from the screening visit\n* Receiving treatment with an SGLT2 inhibitor and/or GLP-1 receptor agonist for at least 3 months, have been offered these therapies previously, or contraindication/intolerance to receiving these therapies\n* Willing to wear study devices and follow study instructions\n* Capable of giving an informed consent\n\nExclusion Criteria:\n\n* Type 1 diabetes\n* Current use of insulin pump\n* Current use of any closed-loop system\n* Alternative cause of CKD according to medical records such as polycystic kidney disease, glomerulonephritis, congenital urogenital tract diseases, etc.\n* Known or suspected allergy against insulin\n* Pregnancy, planned pregnancy, or breast feeding\n* Severe visual impairment\n* Severe hearing impairment\n* Two episodes of severe hypoglycemia in the last 6 months\n* Medically documented allergy towards the adhesive (glue) of plasters\n* Serious skin diseases located at places of the body, which potentially are possible to be used for localisation of the glucose sensor\n* Any physical/psychological disease or medication(s) likely to interfere with the conduct of the study and interpretation of the study results, as judged by study clinician\n* Recent (less than three months) history of myocardial infarction, percutaneous coronary intervention, stroke, or hospitalization for heart failure with reduced ejection fraction\n* Active cancer : primary tumour or metastatic\n* Treatment with immunosuppressants within 3 months prior to screening\n* Known or suspected non-compliance, drug or alcohol abuse\n* Inability to follow the procedures of the investigation, e.g. due to language problems\n* Incapacity to give informed consent\n* Contra-indication to undergo MR-imaging according to a standard checklist such as the presence of a pacemaker or other implanted metallic device or severe claustrophobia.\n* Subject refuses to be informed of incidental findings related to their health discovered during imaging or other study-related exams\n* Participation in another investigation with an investigational drug or another MD within the 30 days preceding and during the present investigation\n* Previous enrolment into the current investigation\n* Enrolment of the PI, his/her family members, employees and other dependent persons",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Have you been diagnosed with type 2 diabetes for at least 12 months?",
        "Have you been treated with insulin for at least 6 months?",
        "Have you had stage 3 chronic kidney disease for at least 6 months?",
        "Is your HbA1c less than 12% based on a recent blood test?",
        "Have you been treated with an SGLT2 inhibitor and/or GLP-1 receptor agonist for at least 3 months, or have you been offered these therapies before, or do you have a reason you can't take these therapies?",
        "Are you willing to wear study devices and follow study instructions?",
        "Can you give informed consent?"
      ],
      "exclusion": [
        "Do you have type 1 diabetes?",
        "Do you currently use an insulin pump?",
        "Do you currently use any closed-loop insulin system?",
        "Do you have an alternative cause of kidney disease such as polycystic kidney disease or glomerulonephritis?",
        "Do you have a known or suspected allergy to insulin?",
        "Are you pregnant, planning to become pregnant, or breastfeeding?",
        "Do you have severe visual impairment?",
        "Do you have severe hearing impairment?",
        "Have you had two episodes of severe hypoglycemia in the last 6 months?",
        "Do you have a medically documented allergy to the adhesive (glue) of plasters?",
        "Do you have serious skin diseases where the glucose sensor might be placed?",
        "Do you have any physical or psychological disease or take medications that might interfere with the study?",
        "Have you had a heart attack, stroke, or been hospitalized for heart failure in the last three months?",
        "Do you have active cancer?",
        "Have you taken immunosuppressants within the last 3 months?",
        "Do you have issues with drug or alcohol abuse?",
        "Do you have trouble following the study procedures, for example due to language problems?",
        "Are you unable to give informed consent?",
        "Do you have any condition that prevents you from undergoing an MRI, such as a pacemaker or severe claustrophobia?",
        "Do you refuse to be informed of incidental findings related to your health discovered during the study?",
        "Have you participated in another clinical trial in the last 30 days?",
        "Have you previously enrolled in this investigation?",
        "Are you a family member, employee, or dependent of the principal investigator?"
      ]
    }
  }
]