[
  {
    "nct_id": "NCT07135570",
    "title": "Stop Blindness in Coastal Bangladesh: Testing the Effectiveness of Community-Based, Artificial Intelligence-Assisted Eye Disease Screening in Coastal Bangladesh",
    "relevance_score": {
      "num_keywords": 3,
      "total_occurrences": 36,
      "keywords_found": [
        "eye",
        "type 2",
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Age 35+ years\n* Residing in the Sub-District of Char Fasson in the Bhola District\n\nExclusion Criteria:\n\n* Known eye disease diagnosis",
      "sex": "ALL",
      "minimum_age": "35 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you 35 years old or older?",
        "Do you live in the Sub-District of Char Fasson in the Bhola District?"
      ],
      "exclusion": [
        "Have you ever been diagnosed with an eye disease?"
      ]
    }
  },
  {
    "nct_id": "NCT04998461",
    "title": "Impact of Obesity, Chronic Kidney Disease and Type 2 Diabetes on Human Urinary Stem Cells",
    "relevance_score": {
      "num_keywords": 3,
      "total_occurrences": 21,
      "keywords_found": [
        "urinary",
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria - For all participants :\n\n* Age between 18 and 60\n* Non diabetic (fasting blood glucose \\<1.26 g/L)\n* Patient not having objected to participating in the research\n\nInclusion Criteria - For the obese group with normal renal function\n\n* eDFG ≥ 60 ml/min/1.73 m2\n* BMI \\> 30 kg/m2\n* Microalbuminuria / creatinuria ≤ 3mg / mmol and / or proteinuria \\< 0.15 g/24h\n\nInclusion Criteria - For the obese group with impaired renal function\n\n* eDFG \\< 60 ml/min/1.73 m2\n* BMI \\> 30 kg/m2\n* Microalbuminuria / creatinuria ≤ 3mg / mmol and / or proteinuria \\< 0.15 g/24h\n\nInclusion Criteria - For the non-obese group with impaired renal function\n\n* eDFG \\< 60 ml/min/1.73 m2\n* BMI between 18 and 30 kg/m2\n* Microalbuminuria / creatinuria ≤ 3mg / mmol and / or proteinuria \\< 0.15 g/24h\n\nInclusion Criteria - For the non-obese group with normal renal function (control group)\n\n* eDFG ≥ 60 ml/min/1.73 m2\n* BMI between 18 and 30 kg/m2\n* Microalbuminuria / creatinuria ≤ 3mg / mmol and / or proteinuria \\< 0.15 g/24h\n\nExclusion Criteria - For all participants :\n\n* Acute renal failure within 3 months (defined as an increase of more than 50% in usual creatinemia)\n* Inflammatory, infectious, cardiovascular or progressive neoplastic disease\n* Urinary pathology (malformation, infection, etc.)\n* Exclusion period of a previous study or already participating in a clinical research protocol having an impact on the judgment criteria of the study",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "60 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 60 years old?",
        "Is your fasting blood sugar less than 1.26 g/L?",
        "Do you agree to participate in this research?",
        "Is your kidney function (eDFG) 60 ml/min/1.73 m2 or higher?",
        "Is your BMI greater than 30 kg/m2?",
        "Is your microalbuminuria/creatinuria ratio ≤ 3mg/mmol and/or proteinuria < 0.15 g/24h?",
        "Is your kidney function (eDFG) less than 60 ml/min/1.73 m2?",
        "Is your BMI between 18 and 30 kg/m2?"
      ],
      "exclusion": [
        "Have you had a sudden worsening of kidney function in the last 3 months?",
        "Do you have any inflammatory, infectious, heart, or cancerous disease?",
        "Do you have any urinary tract problems like malformation or infection?",
        "Are you currently excluded from another study or participating in another clinical research?"
      ]
    }
  },
  {
    "nct_id": "NCT02916680",
    "title": "Pancreatic Islet Transplantation in the Anterior Chamber of the Human Eye - a Pilot Study",
    "relevance_score": {
      "num_keywords": 3,
      "total_occurrences": 13,
      "keywords_found": [
        "eye",
        "kidney",
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Type 1 Diabetes (American Diabetes Association criteria)\n2. Kidney transplant recipient with ongoing immunosuppression\n3. At least one eye with extensive loss of vision from hand motion to no light perception due to damage of retina or optic nerve\n4. Age ≥ 18 years\n5. Normal cornea with good visualization of the anterior segment\n6. Patient not eligible or with no wish for standard pancreatic islet into the hepatic portal system or pancreas transplantation\n\nExclusion Criteria:\n\n1. Uncontrolled diabetic retinopathy\n2. Signs of current infection\n3. Poor visualization of the anterior chamber",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Do you have Type 1 Diabetes?",
        "Have you had a kidney transplant and are taking immunosuppression medication?",
        "Do you have at least one eye with very poor vision or no vision at all?",
        "Are you 18 years or older?",
        "Do you have a normal cornea with good visibility of the front part of your eye?",
        "Are you not eligible or do not want standard pancreatic islet or pancreas transplantation?"
      ],
      "exclusion": [
        "Do you have uncontrolled diabetic retinopathy?",
        "Do you currently have any signs of infection?",
        "Do you have poor visibility of the front part of your eye?"
      ]
    }
  },
  {
    "nct_id": "NCT06272851",
    "title": "Comparing the Choroidal Thickness Using Optical Coherence Tomography Between the Eyes of Healthy Individuals and Diabetic Patients Without Retinopathy",
    "relevance_score": {
      "num_keywords": 3,
      "total_occurrences": 5,
      "keywords_found": [
        "eye",
        "type 2",
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* All known Type 2 DM patients aged 30 to 95 years either gender who presented to ophthalmology clinics in Assuit ophthalmology hospital with no history of ocular treatment (ocular treatment naïve) and visual acuity of 0.1 (6/60) or more that are able to complete an eye examination, and non-diabetic healthy individuals (HbA1c \\<7) will be included in the study.\n\nExclusion Criteria:\n\n* Known diagnosis of any other retinal disease, glaucoma, neurodegenerative disease, and any significant media opacities that precluded fundus imaging and not giving consent will be excluded.",
      "sex": "ALL",
      "minimum_age": "30 Years",
      "maximum_age": "95 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 30 and 95 years old?",
        "Have you been diagnosed with Type 2 diabetes?",
        "Have you never had any eye treatment before?",
        "Is your vision 0.1 (6/60) or better with glasses or contact lenses?",
        "Can you complete an eye examination?",
        "Are you a healthy person without diabetes (HbA1c < 7)?"
      ],
      "exclusion": [
        "Have you been diagnosed with any retinal disease?",
        "Have you been diagnosed with glaucoma?",
        "Have you been diagnosed with a neurodegenerative disease?",
        "Do you have any significant cloudiness in your eye that affects imaging?",
        "Are you unwilling to give consent for the study?"
      ]
    }
  },
  {
    "nct_id": "NCT06030544",
    "title": "Oleanolic Acid as Therapeutic Adjuvant for Type 2 Diabetes Mellitus (OLTRAD STUDY)",
    "relevance_score": {
      "num_keywords": 3,
      "total_occurrences": 4,
      "keywords_found": [
        "eye",
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. community-residing men and women aged.\n2. Body Mass Index (BMI) between 25 and 39.9 kg/m2.\n3. diagnosed with T2DM \\[Following the American Diabetes Association (ADA) 2019 criteria\\] at least six months before being included in this trial.\n4. be treated with metformin (stable dose \\>= 850 mg/day at least three months before recruitment) as monotherapy, or in combination with other hypoglycemic agents (administration of insulin exclusively in a single basal dose), except pioglitazone and sulphonylureas.\n5. HbA1c below 9% at baseline, with a variation compared with a prior HbA1c from at least three months before inclusion in this trial of less than +/- 0.5 %.\n6. be able to give voluntary informed consent and willing to comply with all study procedures.\n\nExclusion Criteria:\n\n1. suffering from Type 1 Diabetes Mellitus or latent autoimmune diabetes in adults.\n2. suffering from chronic kidney disease (estimated glomerular filtration rate (eGFR) \\<30 ml/min/1.73m2).\n3. suffering from acute or chronic hepatitis, signs and symptoms of any liver disease other than non-alcoholic fatty liver disease (NAFLD), or ALT/AST ratio \\>3 times the upper limit of the reference range.\n4. To present, at the time of recruitment, allergies and intolerances associated with food consumption.\n5. pregnant and lactating women.\n6. lack of willingness to use a highly effective contraceptive method (in women of childbearing potential).\n7. fasting triglyceridemia \\> 600 mg/dL despite adequate treatment.\n8. grade 3 hypertension (systolic blood pressure ≥ 180 mm Hg and/or diastolic blood pressure ≥ 110 mm Hg) according to the 2018 guidelines of the European Society of Hypertension.\n9. use of pioglitazone or sulfonylureas.\n10. being treated with medications that promote weight loss (eg, Saxenda® \\[liraglutide 3.0 mg\\], Xenical® \\[orlistat\\], or similar over-the-counter \\[OTC\\] medications) within six months prior to the start of the trial.\n11. Being on chronic (\\>14 days) therapy with systemic glucocorticoids (excluding topical, intraocular, intranasal, intra-articular, or inhaled preparations) within six months prior to enrollment.\n12. Presenting any of the following cardiovascular conditions within 6 months prior to study entry: acute myocardial infarction, unstable angina, New York Heart Association (NYHA) class III or class IV heart failure, or cerebrovascular accident.\n13. Evidence, in the investigators' opinion, of significant uncontrolled endocrine abnormality (e.g., thyrotoxicosis, adrenal crisis) at baseline.\n14. History of active or untreated malignancy, or being in remission from a clinically significant malignancy (other than basal or squamous cell skin cancer, cervical carcinoma in situ, or prostate cancer in situ) during the last 5 years before the study entry.\n15. Participation in the last 30 days in a clinical trial with an investigational product \\[if the previous investigational product has a long half-life, 3 months or 5 half-lives (whichever is longer) should have passed\\].\n16. Being, at the time of recruitment, enrolled in any other clinical trial involving an investigational product or any other type of medical research that is not considered scientifically or medically compatible with this study.\n17. Presence of any hematologic condition that may interfere with HbA1c measurement (eg, hemolytic anemias, sickle cell anemia).\n18. History of any other condition (eg, known drug or alcohol abuse or psychiatric disorder, or any other physical or intellectual limitations), which, in the opinion of the investigator, may prevent the patient from following and completing the protocols.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you a man or woman living in the community?",
        "Is your BMI between 25 and 39.9?",
        "Have you been diagnosed with type 2 diabetes at least six months ago?",
        "Are you taking metformin (at least 850 mg/day) for at least three months?",
        "Is your HbA1c level below 9% with less than +/- 0.5% change in the last three months?",
        "Are you willing to follow all study procedures and give informed consent?"
      ],
      "exclusion": [
        "Do you have type 1 diabetes or latent autoimmune diabetes?",
        "Do you have chronic kidney disease with eGFR <30 ml/min/1.73m2?",
        "Do you have liver disease or high ALT/AST levels (more than 3 times normal)?",
        "Do you have allergies or intolerances to certain foods?",
        "Are you pregnant or breastfeeding?",
        "Are you willing to use a highly effective contraceptive method (if applicable)?",
        "Do you have high triglycerides (> 600 mg/dL) despite treatment?",
        "Do you have severe high blood pressure (>= 180/110 mm Hg)?",
        "Are you taking pioglitazone or sulfonylureas?",
        "Have you taken weight loss medications in the last six months?",
        "Have you used systemic glucocorticoids for more than 14 days in the last six months?",
        "Have you had a heart attack, unstable angina, severe heart failure, or stroke in the last six months?",
        "Do you have significant uncontrolled hormone problems?",
        "Have you had cancer in the last 5 years (except certain skin or cervical cancers)?",
        "Have you participated in another clinical trial in the last 30 days?",
        "Are you currently in another clinical trial?",
        "Do you have any blood conditions that may affect HbA1c measurement?",
        "Do you have any other condition that may prevent you from completing the study?"
      ]
    }
  },
  {
    "nct_id": "NCT06013865",
    "title": "An Exploratory Investigation of the Safety of Empagliflozin in Kidney Transplant Recipients (SEKTR)",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 21,
      "keywords_found": [
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Adult (\\>18 years of age) male and female recipients (all races and ethnicities)\n2. Subject must be able to understand and provide consent\n3. Recipient of a primary or secondary kidney transplant at least 3 months or longer since transplant\n4. For subjects with T2DM or post-transplant diabetes (PTDM), measured kidney function by CKD epi eGFR must be 30mL/min/1.73m2 to \\< 45ml/min/1.73m2 or CKD epi eGFR 45 mL/min/1.73m2 to 90ml/min/1.73m2 with urinary albumin:creatinine ratio 200 mg/g (or protein:creatinine 300 mg/g).\n5. For subjects without T2DM or PTDM: measured kidney function by CKD epi eGFR must be 20mL/min/1.73m2 to \\< 45ml/min/1.73m2 or CKD epi eGFR 45 mL/min/1.73m2 to 90ml/min/1.73m2 with urinary albumin:creatinine ratio 200 mg/g (or protein:creatinine 300 mg/g).\n\nExclusion Criteria:\n\n1. Inability or unwillingness of a participant to give written informed consent or comply with study protocol\n2. History of prior pancreas transplant\n3. CKD epi eGFR \\< 30 mL/min/1.73m2 for those with T2DM or \\< 20 mL/min/1.73m2 for those without T2DM or anyone with 5mL/min/1.73m2 fall in eGFR per year\n4. Uncontrolled type 2 diabetes mellitus with most recent A1C\\>12%\n5. History of \\>2 urinary tract infections per year or UTIs requiring admission in the last year, or urosepsis in the last year.\n6. Use of SGLT2i within 90 days\n7. Documented allergy to SGLT2i\n8. History of Type I diabetes mellitus\n9. History of diabetic ketoacidosis\n10. Indwelling foley catheter or urinary diversion\n11. Acute rejection in the prior 3 months\n12. Acute MACE event within 3 months of the study\n13. Severe congestive heart failure (NYHA functional class III or higher)\n14. Active mucocutaneous mycotic infection of the groin or external genitalia.\n15. History of amputation due to peripheral vascular disease and/or diabetic foot ulcers within prior year\n16. History of malignancy except non-melanoma skin cancer within 2 years of screening\n17. Known of active current viral, fungal, mycobacterial, or other infections (including, but not limited to tuberculosis and atypical mycobacterial disease)\n18. HIV infected subjects, including those who are well controlled on anti-retrovirals\n19. Recent (within 6 months) Positive Hep B PCR or active disease\n20. Hepatitis C virus antibody positive (HCVAb+) subjects who have failed to demonstrate sustained viral remission for more than 12 weeks (after anti-viral treatment)\n21. Active pregnancy in a female transplant recipient\n22. A condition, in the eyes of the investigator, that precludes inclusion into the study.",
      "sex": "ALL",
      "minimum_age": "19 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Can you understand and give consent for this study?",
        "Did you receive a kidney transplant at least 3 months ago?",
        "Do you have type 2 diabetes or diabetes after transplant with a kidney function between 30 and 45, or between 45 and 90 with high protein in urine?",
        "Do you not have diabetes but have a kidney function between 20 and 45, or between 45 and 90 with high protein in urine?"
      ],
      "exclusion": [
        "Are you unable or unwilling to give written consent or follow the study rules?",
        "Have you ever had a pancreas transplant?",
        "Do you have type 2 diabetes with a kidney function less than 30, or without diabetes less than 20, or a drop in kidney function by 5 in the last year?",
        "Do you have uncontrolled type 2 diabetes with recent A1C greater than 12%",
        "Have you had more than 2 urinary tract infections in a year, or any requiring hospital stay, or a severe urinary infection in the last year?",
        "Have you used SGLT2 inhibitors in the last 90 days?",
        "Are you allergic to SGLT2 inhibitors?",
        "Do you have type 1 diabetes?",
        "Have you ever had diabetic ketoacidosis?",
        "Do you currently have a foley catheter or urinary diversion?",
        "Have you had an acute rejection in the last 3 months?",
        "Have you had a major heart event in the last 3 months?",
        "Do you have severe heart failure?",
        "Do you have an active fungal infection in the groin or genital area?",
        "Have you had an amputation due to poor blood flow or diabetic foot ulcers in the last year?",
        "Have you had cancer (except non-melanoma skin cancer) in the last 2 years?",
        "Do you have any active infections like tuberculosis?",
        "Are you HIV positive?",
        "Have you had a positive Hepatitis B test in the last 6 months?",
        "Are you Hepatitis C positive and have not been cured for more than 12 weeks?",
        "Are you currently pregnant?",
        "Do you have any condition that the study doctor thinks would make you unsuitable for the study?"
      ]
    }
  },
  {
    "nct_id": "NCT06330480",
    "title": "Check@Home: General Population Screening for Early Detection of Atrial Fibrillation and Chronic Kidney Disease",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 17,
      "keywords_found": [
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* aged between 50 and 75 years\n* living in the selected regions (Breda, Utrecht, Arnhem, Eindhoven)\n\nExclusion Criteria:\n\n* age \\<50 years or \\>75 years\n* not living in the selected regions (Breda, Utrecht, Arnhem, Eindhoven)\n* being institutionalized (e.g., subjects with intellectual disabilities or subjects living in nursing homes who have a limited life expectancy)\n* participants of the previously conducted THOMAS Study (NL65228.042.18, METc 2018/687) will be excluded.",
      "sex": "ALL",
      "minimum_age": "50 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 50 and 75 years old?",
        "Do you live in Breda, Utrecht, Arnhem, or Eindhoven?"
      ],
      "exclusion": [
        "Are you younger than 50 or older than 75 years?",
        "Do you live outside of Breda, Utrecht, Arnhem, and Eindhoven?",
        "Are you living in a nursing home or institutionalized?",
        "Have you participated in the THOMAS Study (NL65228.042.18, METc 2018/687)?"
      ]
    }
  },
  {
    "nct_id": "NCT00286637",
    "title": "Novel Diagnostics for Ocular Structure",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 16,
      "keywords_found": [
        "eye",
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Ability to provide informed consent and to understand the study procedures\n* Healthy volunteers\n* Age related macular degeneration (AMD), diabetic retinopathy, central serous chorioretinopathy, and/or glaucoma or glaucoma suspects\n* (AD Sub-Study ONLY): Subjects diagnosed with AD or MCI.\n\nExclusion Criteria:\n\n* Any medical treatment (e.g., chronic corticosteroid, hydroxychloroquine, chloroquine, thioridazine, canthaxanthine) or conditions that affect VF (e.g., stroke) and retinal thickness other than glaucoma.\n* Strabismus, nystagmus, or any condition that prevents fixation.\n* Presence of any media opacities that hinders clinical view of the fundus, and any intraocular non-glaucomatous abnormality\n* History of ocular trauma or intraocular surgery other than uncomplicated glaucoma interventions or cataract extraction at least 3 months previous to participating in the study.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Can you provide consent and understand the study procedures?",
        "Are you a healthy volunteer?",
        "Have you been diagnosed with age-related macular degeneration (AMD)?",
        "Have you been diagnosed with diabetic retinopathy?",
        "Have you been diagnosed with central serous chorioretinopathy?",
        "Have you been diagnosed with glaucoma or told you might have glaucoma?",
        "Have you been diagnosed with Alzheimer's disease (AD) or mild cognitive impairment (MCI)?"
      ],
      "exclusion": [
        "Are you currently taking any medical treatment that affects vision or retinal thickness?",
        "Have you had a stroke?",
        "Do you have strabismus or nystagmus?",
        "Do you have any condition that prevents you from focusing your eyes?",
        "Do you have any cloudiness in your eyes that makes it hard to see the back of your eye?",
        "Do you have any non-glaucoma related eye abnormalities?",
        "Have you ever had eye trauma or eye surgery other than for glaucoma or cataract extraction?",
        "Have you had cataract surgery or glaucoma intervention in the last 3 months?"
      ]
    }
  },
  {
    "nct_id": "NCT02037321",
    "title": "Effect of Substituting Plant Protein for Animal-Protein on Cardiometabolic Risk: A Series of Systematic Reviews and Meta-Analyses of Controlled Feeding Trials to Provide Evidence-Based Guidance for Nutrition Guidelines Development",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 9,
      "keywords_found": [
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Dietary trials in humans\n* Randomized treatment allocation\n* \\>=3 weeks\n* Suitable control (i.e. exchange with animal-protein)\n* Viable endpoint data\n\nExclusion Criteria:\n\n* Non-human studies\n* Nonrandomized treatment allocation\n* \\<3 weeks\n* Lack of a suitable control (i.e. no exchange with animal-protein)",
      "sex": "ALL",
      "minimum_age": "N/A",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you part of a study about human diets?",
        "Were you randomly assigned to a treatment group?",
        "Will the study last for 3 weeks or more?",
        "Does the study include a control group that uses animal-protein?",
        "Will the study measure health outcomes at the end?"
      ],
      "exclusion": [
        "Is the study about non-human subjects?",
        "Were you not randomly assigned to a treatment group?",
        "Will the study last less than 3 weeks?",
        "Does the study lack a control group that uses animal-protein?"
      ]
    }
  },
  {
    "nct_id": "NCT03549754",
    "title": "Real-world Multinational Registry to Determine Management and Quality of Care of Patients With Type 2 Diabetes, Hypertension, Heart Failure and/or Chronic Kidney Diseases",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 9,
      "keywords_found": [
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Being 18 years or older\n2. Having type 2 diabetes, Hypertension, Heart Failure and/or chronic kidney disease\n3. Providing written informed consent to participate in the registry\n\nExclusion Criteria:\n\n1. Having a life-threatening co-morbidity with life expectancy below 1 year\n2. Participating in an interventional trial requiring informed consent",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Do you have type 2 diabetes?",
        "Do you have high blood pressure?",
        "Do you have heart failure?",
        "Do you have chronic kidney disease?",
        "Are you willing to provide written consent to participate in this study?"
      ],
      "exclusion": [
        "Do you have a serious health condition that may reduce your life expectancy to less than 1 year?",
        "Are you currently participating in another clinical trial that requires your consent?"
      ]
    }
  },
  {
    "nct_id": "NCT06579404",
    "title": "An Open-label, Multinational, Multicentre, Randomised, Single-period Parallel Study to Assess the Efficacy, Safety and Utility of Fully Closed-loop Insulin Delivery Compared to Standard Insulin Therapy With CGM in Adults With Type 2 Diabetes",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 8,
      "keywords_found": [
        "urinary",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Aged 18 years and older\n* Type 2 diabetes diagnosed for at least 12 months\n* Established on an SGLT2 inhibitor and/or GLP-1 receptor agonist for at least 3 months, or have been offered these therapies previously.\n* Treatment with insulin therapy for at least 6 months\n* HbA1c ≤ 15% (140 mmol/mol) analysis from local laboratory or equivalent\n* Willing to wear study devices and follow study instructions\n* Capacity to consent to participate in the study\n\nExclusion Criteria:\n\n* Type 1 diabetes\n* Current use of insulin pump\n* Current use of any closed-loop system\n* Any physical/psychological disease or medication(s) likely to interfere with the conduct of the study and interpretation of the study results, as judged by study clinician\n* Known or suspected allergy against insulin\n* Medically documented allergy towards the adhesive\n* Pregnancy, planned pregnancy, or breast feeding\n* Severe visual impairment\n* Severe hearing impairment\n* Medically documented allergy towards the adhesive (glue) of plasters\n* Serious skin diseases located at places of the body, which potentially are possible to be used for localisation of the glucose sensor\n* Illicit drugs abuse\n* Prescription drugs abuse\n* Alcohol abuse",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Have you been diagnosed with type 2 diabetes for at least 12 months?",
        "Have you been on an SGLT2 inhibitor and/or GLP-1 receptor agonist for at least 3 months?",
        "Have you been offered SGLT2 inhibitors and/or GLP-1 receptor agonists before?",
        "Have you been treated with insulin for at least 6 months?",
        "Is your HbA1c level 15% or lower?",
        "Are you willing to wear the study devices and follow the study instructions?",
        "Do you have the capacity to consent to participate in the study?"
      ],
      "exclusion": [
        "Do you have type 1 diabetes?",
        "Are you currently using an insulin pump?",
        "Are you currently using any closed-loop system?",
        "Do you have any physical or psychological condition that may interfere with the study?",
        "Do you have a known or suspected allergy to insulin?",
        "Are you allergic to the adhesive used in plasters?",
        "Are you pregnant, planning to become pregnant, or breastfeeding?",
        "Do you have severe visual impairment?",
        "Do you have severe hearing impairment?",
        "Do you have serious skin diseases where the glucose sensor might be placed?",
        "Have you abused illicit drugs?",
        "Have you abused prescription drugs?",
        "Have you abused alcohol?"
      ]
    }
  },
  {
    "nct_id": "NCT05883072",
    "title": "Exploring the Effectiveness of AI Generative Models for Diabetic Patients",
    "relevance_score": {
      "num_keywords": 2,
      "total_occurrences": 2,
      "keywords_found": [
        "kidney",
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Present physically in Pakistan\n* Adults (18 years or older)\n* Diabetic Patient\n\nExclusion Criteria:\n\n* Adults unable to consent\n* Individuals who are not yet adults (infants, children, teenagers)\n* Prisoners",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "100 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you currently in Pakistan?",
        "Are you 18 years or older?",
        "Have you been diagnosed with diabetes?"
      ],
      "exclusion": [
        "Are you unable to give consent?",
        "Are you younger than 18 years old?",
        "Are you currently in prison?"
      ]
    }
  },
  {
    "nct_id": "NCT03761446",
    "title": "The Role of Type 2 Diabetes on Skeletal Muscle Atrophy and Recovery Following Bed Rest in Older Adults",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 11,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria\n\n1. Participant must be male or female between the ages of 60 and 80 years of age.\n2. Participant has pre-diabetes or type 2 diabetes and is only taking DPP-4 inhibitors, Sulfonylureas and/or Metformin therapy (but not Insulin, injectable incretin mimeticsSGL2 inhibitors, and Thiazolidinedione's), and has an A1C \\< 8.0.\n\n   1. Pre-Diabetics are defined as having an HgbA1c of greater than or equal to 5.7% and less 6.5%, or a fasting glucose of greater than or equal to 100 mg/dl and less than 126 mg/dl or has a glucose of greater than or equal to 140 mg/dl and less than 200mg/dl at the 2 hour blood draw during OGTT\n   2. The non-diabetic control group is defined as having an HgbA1c of less than 5.7%, a fasting glucose of less than 100 mg/dl and a glucose level less than 140 mg/dl at the 2hr blood draw during the OGTT.\n3. Participant must have renal function with an estimated glomerular filtration rate (eGFR) \\> 45 ml/min/1.73m2 determined at screening.\n4. Participant's triglyceride level is \\< 350 mg/dl and LDL cholesterol is ≤ 150 mg/dl at screening.\n5. Participants must be non-smokers. Non-smokers as defined by not smoking any tobacco or using nicotine-containing products and not using vape pens or vaporizers within 3 months prior to screening.\n6. Participant states willingness to follow protocol as described, including consumption of study product per protocol, the prescribed activity level and completing any forms needed throughout the study.\n7. Participant has voluntarily signed and dated an informed consent form, approved by an Institutional Review Board/Independent Ethics Committee, and provided Health Insurance Portability and Accountability Act authorization (HIPAA) or other privacy authorization prior to any participation in study.\n\nExclusion Criteria\n\n1. Participant has type 1 Diabetes.\n2. BMI \\> 40.0 kg/m2\n3. Participant is actively pursuing weight loss and/or lifestyle changes.\n4. Participant has a history of pressure ulcers.\n5. Participant has a stated history of Deep Vein Thrombosis (DVT), pulmonary embolism, or a known hypercoagulable condition, or other clotting or bleeding disorders.\n6. History of gastrointestinal or intracranial hemorrhage.\n7. History of stroke or cerebrovascular accident.\n8. Recent history of major trauma (within 3 months).\n9. Thrombocytopenia (of any cause) or hyperkalemia (K \\> 5.0) on screening laboratory assay. May repeat lab value per PI discretion.\n10. Untreated or poorly controlled hypertension (SBP \\> 150, DBP \\> 95), or hypotension (SBP \\<100 DBP \\<60)\n11. Participant has a TSH greater than or equal to 10mIU/L.\n12. Participant has current infection (requiring prescription antimicrobial or antiviral medication, or hospitalization), or corticosteroid treatment (with the exception of inhaled or topical steroids) in the last 3 months prior to screening visit.\n13. Participant is currently taking anti-inflammatory medication or has anti-inflammatory medication in the 1 weeks prior to screening (including over the counter formulations; e.g. Aleve, Motrin, ibuprofen, naproxen).\n14. Participant has had surgery requiring \\> 2 days of hospitalization in the last 1 month prior to screening visit.\n15. Participant has an active malignancy or autoimmune disease.\n16. Participant has current significantly impaired liver function in the opinion of the study PI (mild asymptomatic fatty liver is acceptable), or hepatic enzyme tests are ≥ 2.5 times normal limit.\n17. Participant has a chronic, contagious, infectious disease, such as active tuberculosis, Hepatitis B or C, or HIV.\n18. Participant is an amputee and/or has presence of partial or full artificial limb.\n19. Participant has had a significant cardiovascular event (e.g. myocardial infarction, stroke) ≤ 6 months prior to screening visit; or stated history of congestive heart failure; or participant has evidence of cardiovascular disease assessed during the ECG at screening. In the event of a positive stress test, participants are referred to their primary care physician. If the electrocardiogram (ECG) is determined to be a false positive, participant may be allowed to participate in study after confirmatory records obtained.\n20. Participant has a history of, or currently has uncontrolled severe diarrhea, nausea or vomiting.\n21. Participant has an obstruction of the gastrointestinal tract, inflammatory bowel disease, short bowel syndrome or other forms of gastrointestinal disease such as stage III or above gastroesophageal reflux disease, gastroparesis, peptic ulcer disease, celiac disease, intestinal dysmotility, diverticulitis, ischemic colitis and bariatric surgery.\n22. Participant cannot abstain from alcohol for the pre bed rest and bed rest portion of the study. For the recovery portion of the study the participant must agree to consume no more than 1 glass of wine (4-5 oz) or bottle of beer (12 oz) /day.\n23. Participant cannot refrain from taking medications/dietary supplements/herbals or substances that could modulate glucose metabolism (other than oral hypoglycemic medications), or are considered anabolic, or reduce weight (fat mass), or that may interact with low-molecular weight heparin or induce hypo- or hyper-coagulable state, in the opinion of the PI or medical provider, starting one week prior to enrollment and over the entire course of the study. These include progestational agents (except prescribed birth control), steroids, growth hormone, dronabinol, marijuana, calcium-beta-hydroxy-betamethylbutyrate (CaHMB), free amino acid supplements and dietary supplements to aid weight loss.\n24. Participant has a mini-Mental State Examination score \\< 21.\n25. Subjects who fulfill any of the contraindications for MRI; examples include metal implants, devices, paramagnetic objects contained within the body and excessive or metal-containing tattoos.\n26. Unable to participate in MR or DEXA assessments due to physical limitations of equipment tolerances (e.g., MRI bore size and DEXA 450-pound weight limit) claustrophobia, or based on Investigator's judgment at screening.\n27. Participant has a sensitivity or allergy to lidocaine.\n28. Participant has a sensitivity or allergy to heparin, enoxaparin, or other low molecular weight heparin.\n29. History of allergy to pork products or any component of the formulation of low-molecular weight heparin for dosing.\n30. History of heparin induced thrombocytopenia.\n31. Hemoglobin \\< 10.0 g/dL for females; \\< 11.0 g/dL for males; or participant has clinically significant signs/symptoms of anemia in the opinion of the PI or medical provider.\n32. Concomitant medications with known contraindication or interaction with low-molecular weight heparin (including anti-platelet agents, anti-coagulant agents, non-steroidal anti-inflammatory drugs)\n33. Presence of any condition that, in the opinion of the Investigator, compromises participant safety or data integrity or the participant's ability to complete the study.\n34. Participant experiences symptoms of claudication. Symptoms include cramping pain in the legs and/or difficulty walking.",
      "sex": "ALL",
      "minimum_age": "60 Years",
      "maximum_age": "80 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 60 and 80 years old?",
        "Have you been diagnosed with pre-diabetes or type 2 diabetes?",
        "Are you only taking DPP-4 inhibitors, Sulfonylureas, and/or Metformin for diabetes?",
        "Is your A1C level less than 8.0?",
        "Is your HgbA1c between 5.7% and 6.5%, or fasting glucose between 100 mg/dl and 126 mg/dl?",
        "Is your HgbA1c less than 5.7% and fasting glucose less than 100 mg/dl?",
        "Is your kidney function normal with eGFR greater than 45 ml/min?",
        "Is your triglyceride level less than 350 mg/dl?",
        "Is your LDL cholesterol level 150 mg/dl or less?",
        "Have you avoided smoking or using nicotine products in the last 3 months?",
        "Are you willing to follow the study protocol, including diet and activity levels?",
        "Have you signed the informed consent form and provided HIPAA authorization?"
      ],
      "exclusion": [
        "Have you been diagnosed with type 1 diabetes?",
        "Is your BMI greater than 40.0 kg/m2?",
        "Are you currently trying to lose weight or change your lifestyle?",
        "Have you ever had pressure ulcers?",
        "Have you ever had deep vein thrombosis, pulmonary embolism, or a clotting disorder?",
        "Have you ever had gastrointestinal or brain bleeding?",
        "Have you ever had a stroke?",
        "Have you experienced major trauma in the last 3 months?",
        "Do you have low platelet count or high potassium levels?",
        "Do you have untreated or poorly controlled high or low blood pressure?",
        "Is your TSH level 10 mIU/L or higher?",
        "Have you had an infection requiring medication or hospitalization in the last 3 months?",
        "Have you taken anti-inflammatory medication in the last week?",
        "Have you had surgery requiring more than 2 days of hospitalization in the last month?",
        "Do you have an active cancer or autoimmune disease?",
        "Do you have significant liver problems?",
        "Do you have a chronic infectious disease like tuberculosis, Hepatitis B or C, or HIV?",
        "Are you an amputee or have an artificial limb?",
        "Have you had a significant heart event in the last 6 months?",
        "Do you have uncontrolled severe diarrhea, nausea, or vomiting?",
        "Do you have gastrointestinal disease or had bariatric surgery?",
        "Can you abstain from alcohol during the pre bed rest and bed rest portion of the study?",
        "Can you avoid taking certain medications or supplements starting one week prior to the study?",
        "Have you been diagnosed with a cognitive impairment?",
        "Do you have any metal implants or devices that would prevent you from having an MRI?",
        "Are you unable to participate in MRI or DEXA assessments due to physical limitations?",
        "Are you allergic to lidocaine?",
        "Are you allergic to heparin or similar medications?",
        "Are you allergic to pork products?",
        "Have you ever had heparin-induced thrombocytopenia?",
        "Is your hemoglobin level less than 10.0 g/dL (females) or 11.0 g/dL (males)?",
        "Are you taking medications that interact with low-molecular weight heparin?",
        "Do you have any condition that the study doctor thinks would compromise your safety or data integrity?",
        "Do you experience symptoms of claudication, such as cramping pain in the legs or difficulty walking?"
      ]
    }
  },
  {
    "nct_id": "NCT04271709",
    "title": "The Manhattan Vision Screening and Follow-Up Study (NYC-SIGHT)",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 10,
      "keywords_found": [
        "eye"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Individuals over age 40\n* Living independently in NYCHA housing building or attending DFTA Senior Center\n* Willing to answer COVID-19 symptom questions\n* Willing to consent for 2 vision screening visits at baseline and 12-month follow-up\n\nExclusion Criteria:\n\n* Self-reported terminal illness with life expectancy less than 1 year\n* Inability to provide informed consent due to dementia or other reasons",
      "sex": "ALL",
      "minimum_age": "40 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you over the age of 40?",
        "Do you live independently in an NYCHA housing building?",
        "Do you attend a DFTA Senior Center?",
        "Are you willing to answer questions about COVID-19 symptoms?",
        "Are you willing to come for 2 vision screening visits, one now and one in 12 months?"
      ],
      "exclusion": [
        "Have you been diagnosed with a terminal illness with less than 1 year life expectancy?",
        "Do you have difficulty providing informed consent due to dementia or other reasons?"
      ]
    }
  },
  {
    "nct_id": "NCT06775288",
    "title": "Effect of Hypoglycemia Prevention and Awareness Program (HypoPAP) on Patient Outcomes: Randomized Controlled Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 6,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Being 18 years of age and older\n* Being able to communicate in Turkish\n* Being diagnosed with type 2 diabetes\n* Having used insulin for at least one year\n* Having reduced hypoglycemia awareness\n* Being willing to participate in the study\n* Having and being able to use information technology products (telephone, computer).\n\nExclusion Criteria:\n\n* Having visual, auditory, cognitive impairment\n* Having a condition that prevents communication\n* Not being able to use information technology products\n* Having chronic renal failure, chronic vascular disease, chronic liver disease, cancer\n* Pregnancy\n* Endocrine and eating disorders\n* Individuals who do not agree to participate in the study\n* Do not meet the inclusion criteria will not be included.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years old or older?",
        "Can you communicate in Turkish?",
        "Have you been diagnosed with type 2 diabetes?",
        "Have you used insulin for at least one year?",
        "Do you have reduced awareness of low blood sugar?",
        "Are you willing to participate in this study?",
        "Do you have and can you use a telephone or computer?"
      ],
      "exclusion": [
        "Do you have trouble seeing, hearing, or understanding information?",
        "Do you have a condition that prevents you from communicating?",
        "Are you unable to use a telephone or computer?",
        "Have you been diagnosed with chronic kidney, vascular, or liver disease, or cancer?",
        "Are you pregnant?",
        "Do you have an endocrine or eating disorder?",
        "Are you not willing to participate in this study?"
      ]
    }
  },
  {
    "nct_id": "NCT01967030",
    "title": "SWIFT: Study of Women, Infant Feeding and Type 2 Diabetes After GDM Pregnancy",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 6,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* age 20 to 45 years at delivery\n* received prenatal care in Kaiser Permanente Northern California (KPNC) health care system\n* Gestational Diabetes (GDM) pregnancy diagnosed using the 3-hour 100 g OGTT by Carpenter and Coustan criteria\n* delivered a singleton, live birth \\>= 35 weeks gestation\n* no pre-existing diabetes or other serious medical conditions prior to index GDM pregnancy\n* no diabetes diagnosis (2-hour 75 gram OGTT) at 6 to 9 weeks postpartum for the index GDM pregnancy\n* no use of thyroid medications, steroids, or other medications affecting glucose tolerance\n* not planning to move from the northern California area within the subsequent 24 months\n* not planning another pregnancy within the next two years\n* Two infant feeding groups: women who did not lactate or did so for less than 3 weeks, OR women who provided no supplemental milk feeds at 2-4 weeks and planned to continue intensive lactation defined as \\<= 1 formula supplement (6 oz/day) from 6-9 weeks until 4 months or more postpartum.\n\nExclusion criteria:\n\n* Women who fed both breast milk and 7-16 oz of formula (mixed feeding) during the first 4 weeks of life",
      "sex": "FEMALE",
      "minimum_age": "20 Years",
      "maximum_age": "45 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 20 and 45 years old?",
        "Did you receive prenatal care in Kaiser Permanente Northern California?",
        "Were you diagnosed with gestational diabetes during pregnancy?",
        "Did you deliver a single baby at 35 or more weeks of pregnancy?",
        "Did you have diabetes or other serious medical conditions before your pregnancy?",
        "Were you diagnosed with diabetes 6 to 9 weeks after giving birth?",
        "Are you taking medications for thyroid, steroids, or other medicines affecting blood sugar?",
        "Do you plan to move from northern California in the next 2 years?",
        "Do you plan to become pregnant in the next two years?",
        "Did you breastfeed for less than 3 weeks or not at all?",
        "Did you provide only breast milk at 2-4 weeks and plan to continue mostly breastfeeding until 4 months or more?"
      ],
      "exclusion": [
        "Did you feed your baby both breast milk and 7-16 oz of formula in the first 4 weeks?"
      ]
    }
  },
  {
    "nct_id": "NCT06497595",
    "title": "Exercise and Nutritional Intervention to Reduce the Risk of Sarcopenia in Older Adults With Type 2 Diabetes and Obesity Treated With Semaglutide: A Randomized Controlled Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 5,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Patients 65-75 years old.\n2. Patients who were previously diagnosed with type 2 diabetes.\n3. Overweight / obesity (body mass index, BMI ≥ 27 kg/m2).\n\nExclusion Criteria:\n\n1. Patients with significant hearing or visual disability.\n2. Patients with Estimated Glomerular Filtration Rate (eGFR)\\<30 ml/min/1.73 m2.\n3. Patients who are in active nutritional therapy.\n4. Patients who changed their diet recently (\\< 1 month) and/or in a weight-loss program with \\>5% weight loss or used anti-obesity drugs in the last 3 months.\n5. Patients who reported a weight loss of \\>5kg within 90 days of screening\n6. Patients who were on Glucagon-like peptide-1 receptor agonists (GLP-1-RA) treatment during the last 3 months.\n7. Patients with musculoskeletal disorders, which, by the judgment of the investigators, would limit their ability to perform the exercise training.\n8. Patients with neurological diseases, which by the judgment of the investigators, would affect their ability to participate in the trial.\n9. Patients with a history of amputation that impairs their ability to participate in the exercise program.\n10. Patients with disabilities, which, by the judgment of the investigators, would affect their ability to participate in the trial.\n11. Patients who use a walking aid.\n12. Patients who are currently using systemic steroids.\n13. Patients with active oncological diseases, excluding non-melanoma skin cancer.\n14. Patients with diagnosed dementia or cognitive impairment that, in the view of the researchers, may impair their ability to sign a consent form or participate in the trial.\n15. Patients who were hospitalized in the past month.\n16. Patients who exercise regularly and in the eyes of the examiner will not benefit from the intervention program.\n17. Anyone who is not suitable to participate in the study, according to the researcher's discretion.\n18. Any contraindication to Magnetic resonance imaging (MRI) (e.g., MRI non-compatible cardiac implantable electronic device, metallic foreign bodies, implantable neurostimulation system, cochlear implants/ear implant, non-removable drug infusion pumps, catheters with metallic components, cerebral artery aneurysm clips which), or inability to perform an MRI scanner (e.g., claustrophobia).\n19. Patients who do not fit within the measurement field of view of the Dual-energy X-ray absorptiometry (DXA) scanner in a supine position with the arms next to the body.",
      "sex": "ALL",
      "minimum_age": "65 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 65 and 75 years old?",
        "Have you been diagnosed with type 2 diabetes?",
        "Is your body mass index (BMI) 27 or higher?"
      ],
      "exclusion": [
        "Do you have significant hearing or visual disability?",
        "Have you been told your kidney function is very low?",
        "Are you currently in a nutritional therapy program?",
        "Have you changed your diet in the last month?",
        "Have you lost more than 5% of your body weight in the last 3 months?",
        "Have you used anti-obesity drugs in the last 3 months?",
        "Have you lost more than 5kg in the last 90 days?",
        "Have you been on GLP-1-RA treatment in the last 3 months?",
        "Do you have muscle or bone problems that limit your ability to exercise?",
        "Do you have nerve problems that would affect your ability to participate?",
        "Have you had an amputation that would affect your ability to exercise?",
        "Do you have any disabilities that would affect your ability to participate?",
        "Do you use a walking aid?",
        "Are you currently using systemic steroids?",
        "Do you have any active cancer, excluding non-melanoma skin cancer?",
        "Have you been diagnosed with dementia or cognitive impairment?",
        "Have you been hospitalized in the past month?",
        "Do you exercise regularly?",
        "Do you have any issues that would prevent you from having an MRI?",
        "Can you fit within the measurement field of a DXA scanner while lying down?"
      ]
    }
  },
  {
    "nct_id": "NCT06861062",
    "title": "Effects of Vitamin D3 and Yeast Beta-Glucan Supplementation on Cardiovascular Disease in Patients With Type 2 Diabetes: A Randomized Double-Blind Controlled Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 5,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Type 2 diabetes mellitus diagnosed by a physician based on the diagnostic criteria outlined in the Guideline for the Prevention and Treatment of Diabetes Mellitus in China (2024 Edition);\n2. Men or women aged 40-79 years;\n3. Convenient access to the study centers and permanent residence in the vicinity for the next five years;\n4. Voluntary participation and signed written informed consent.\n\nExclusion Criteria:\n\n1. History of clinical cardiovascular disease (including myocardial infarction, treatment or hospitalization for heart failure, stroke, and coronary revascularization) within the past 6 months;\n2. History of severe diabetic microvascular complications (diabetic nephropathy with an estimated glomerular filtration rate (eGFR) \\< 30 mL/(min·1.73m²), proliferative diabetic retinopathy, confirmed diabetic peripheral neuropathy with abnormal nerve conduction studies or small fiber neuropathy testing);\n3. History of cancer, excluding non-melanoma skin cancer or cancers with a favorable prognosis;\n4. History of kidney stones, hypercalcemia, or hyperparathyroidism;\n5. History of severe liver disease, severe kidney disease, severe gastrointestinal disease, severe infectious diseases, severe sarcoidosis or other granulomatous diseases, severe mental illness, or any other condition considered unsuitable for participation judged by the clinic team;\n6. Laboratory evaluation:\n\n   * Blood calcium levels greater than or equal to the normal range for the clinical site's laboratory;\n   * Alanine aminotransferase (ALT) or aspartate aminotransferase (AST) levels higher than 3 times the normal range for the clinical site's laboratory;\n   * eGFR \\< 30 mL/(min·1.73m²);\n7. Individuals currently taking vitamin D supplements (\\>400 IU/day), calcium supplements (\\>600 mg/day), yeast β-glucan supplements (\\>250 mg/day), or those with a history of allergy or intolerance to vitamin D or prebiotic products;\n8. Participation in other clinical trials within the past 3 months;\n9. Planning to become pregnant within the next five years, or currently pregnant or breastfeeding.",
      "sex": "ALL",
      "minimum_age": "40 Years",
      "maximum_age": "79 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with type 2 diabetes by a doctor?",
        "Are you between 40 and 79 years old?",
        "Do you live near the study center and plan to stay there for the next five years?",
        "Are you willing to participate and sign the informed consent form?"
      ],
      "exclusion": [
        "Have you had a heart attack, heart failure, stroke, or heart surgery in the past 6 months?",
        "Have you had severe kidney problems, eye problems, or nerve damage from diabetes?",
        "Have you ever been diagnosed with cancer, except for non-melanoma skin cancer?",
        "Have you had kidney stones, high calcium levels, or parathyroid issues?",
        "Do you have severe liver, kidney, stomach, infectious, or mental health issues?",
        "Have you been told your blood calcium levels are too high?",
        "Have you been told your liver function tests are very high?",
        "Have you been told your kidney function is very low?",
        "Are you currently taking vitamin D, calcium, or yeast beta-glucan supplements?",
        "Have you ever had an allergic reaction to vitamin D or prebiotic products?",
        "Have you participated in another clinical trial in the past 3 months?",
        "Are you planning to become pregnant in the next five years, or are you currently pregnant or breastfeeding?"
      ]
    }
  },
  {
    "nct_id": "NCT02577120",
    "title": "Wound Healing Endpoint and Recurrence",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 5,
      "keywords_found": [
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Age ≥ 18\n2. Willing to comply with protocol instructions, including all study visits and study activities.\n3. One of the following: Healed wound (within 10 days prior to consent/screening visit) that was previously a chronic wound of multiple etiologies and open for at least30 days, including:\n\n   i. Diabetic foot ulcers, Wagner grade 1-3 ii. Pressure ulcers, stage 2-3 iii. Venous leg ulcers, confirmed by venous duplex iv. Burn wounds\n4. If candidate has a diabetic foot ulcer, ABI score measurement at Visit 1 must be between 0.7 and 1.2. If score is below or above, candidate will be considered a screen fail. Score can be gathered from EMR in previous 3 months to visit 1 if done as SOC or completed during visit 1.\n\nExclusion Criteria:\n\n1. Individuals who are deemed unable to understand the procedures, risks and benefits of the study, (i.e. unable to provide informed consent).\n2. Subjects with marked immunodeficiency (HIV/AIDS, organ transplant patients and cancer patients and patients with autoimmune disease on immunosuppressive medications).\n3. Wounds closed or to be closed by flap or graft coverage - including stage 4pressure ulcers and Wagner grade 4 or 5 diabetic foot ulcers.\n4. Prisoners\n5. Patients with allergies to petrolatum\n6. Patients who are currently enrolled in another research study which includes investigational treatment and/or medication\n7. Patients with an HbA1c score greater than 10.0 at Visit 1, will be considered a screen fail. Score can be gathered from EMR in previous 12 months to visit 1 if done as SOC, or completed during visit 1.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Are you willing to follow study instructions and attend all visits?",
        "Have you had a wound that has healed in the last 10 days?",
        "Was your wound open for at least 30 days before it healed?",
        "Is your wound one of the following: diabetic foot ulcer, pressure ulcer, venous leg ulcer, or burn wound?"
      ],
      "exclusion": [
        "Do you have trouble understanding the study procedures, risks, and benefits?",
        "Have you been diagnosed with HIV/AIDS, had an organ transplant, or have cancer?",
        "Do you have an autoimmune disease and take medications that weaken your immune system?",
        "Was your wound closed or will it be closed with a flap or graft?",
        "Are you currently in prison?",
        "Are you allergic to petrolatum?",
        "Are you currently enrolled in another research study with investigational treatment and/or medication?",
        "Is your HbA1c score greater than 10.0?"
      ]
    }
  },
  {
    "nct_id": "NCT07298850",
    "title": "A Study on the Effect of CGM Alone on Glycemic Metrics in Type 2 Diabetes Patients Not Using Insulin, Without Additional Interventions",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 5,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Patients with Type 2 Diabetes Mellitus (HbA1c ≥ 6.5%, fasting plasma glucose ≥ 126 mg/dL, 2-hour plasma glucose ≥ 200 mg/dL during 75g OGTT, or random plasma glucose ≥ 200 mg/dL with classic symptoms)\n2. No medication changes in the past 3 months, and receiving treatment with lifestyle modification or oral antidiabetic drugs or GLP-1 receptor agonists\n3. Ages 19 - 80 years old\n4. Patients who have voluntarily signed the informed consent form\n\nExclusion Criteria:\n\n1. Type 1 diabetes patients\n2. Insulin users\n3. Patients who have changed oral hypoglycemic agents within the past 3 months\n4. Patients scheduled for hospitalization within 2 weeks\n5. Pregnant women or those planning pregnancy within 1 month\n6. Those who do not agree to the program\n7. Those deemed unsuitable for participation in this clinical trial by the investigator",
      "sex": "ALL",
      "minimum_age": "19 Years",
      "maximum_age": "80 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with Type 2 Diabetes?",
        "Has your diabetes medication stayed the same in the past 3 months?",
        "Are you between 19 and 80 years old?",
        "Have you signed the informed consent form voluntarily?"
      ],
      "exclusion": [
        "Do you have Type 1 diabetes?",
        "Do you use insulin?",
        "Have you changed your diabetes medication in the past 3 months?",
        "Are you scheduled to be hospitalized within the next 2 weeks?",
        "Are you pregnant or planning to become pregnant within the next month?",
        "Do you disagree with any part of the program?",
        "Have you been told by a doctor that you should not participate in this study?"
      ]
    }
  },
  {
    "nct_id": "NCT02923063",
    "title": "A Randomized, Controlled Trial of Personalized, Home-based Exercise Training on Muscle Mitochondrial Function and Metabolism",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 4,
      "keywords_found": [
        "kidney"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Moderate-severe CKD determined by estimated glomerular filtration rate (eGFR) \\<60ml/min per 1.73m2\n* No history chronic treatment with dialysis.\n* Age 30 years old to 75 years\n* Sedentary defined as self-reporting no more than 1 day per week of regular (structured) endurance exercise (EE) \\[e.g., brisk walking, jogging/running, cycling, elliptical, or swimming activity that results in feelings of increased heart rate or rapid breathing (EE), and/or sweating\\] or resistance exercise (RE) (resulting in muscular fatigue) lasting no more than 60 minutes in the past year.\n\n  * Persons bicycling as a mode of transportation to/from work \\> 1 day/week etc. are not considered sedentary\n  * Leisure walkers are included unless they meet the heart rate, breathing and sweating criteria noted above\n  * Persons adherent to both 1 day/week of RE and 1 day/week of EE are excluded\n\nExclusion Criteria:\n\n* Current or previous transplantation\n* Current pregnancy (all females of child-bearing potential will have a pregnancy test)\n* Wheelchair dependence or other disability that precludes physical exercise\n* Oxygen dependent Chronic obstructive pulmonary disease (COPD)\n* Shortness of breath after walking \\<100 steps on flat surface\n* Weight \\>300 pounds\n* HIV infection or hepatitis viral infection\n* Decompensated cirrhosis\n* Active malignant cancer other than non-melanomatous skin cancer\n* Drugs that alter mitochondrial function:\n\n  * muscle relaxants (methocarbamol, baclofen, tizanidine, carisoprodol, cyclobenzaprine)\n  * oral steroids (Equivalent of 10mg or more of prednisone daily)\n  * anti-viral medications (tenofovir, zalcitabine, didanosine, stavudine, lamivudine, zidovudine, abacavir, adefovir, interferon, ribavirin, efavirenz, dasabuvir, ombitasvir)\n  * oral calcineurin inhibitors (Tacrolimus, Cyclosporine)\n  * Antiepileptic drugs (Phenytoin, phenobarbital, carbamazepine, valproic acid, oxcarbazepine, ethosuximide, zonisamide, topiramate, and vigabatrin)\n  * Antipsychotics (haloperidol, thioridazine, risperidone, quetiapine, clozapine, olanzapine and aripiprazole)\n* Drugs- anticoagulants or antiplatelets\n\n  * Anticoagulants, any 1 (coumadin, rivaroxaban, apixaban, dabigatran, edoxaban)\n  * Antiplatelets, any 2 (aspirin, cilostazol, clopidogrel, dipyridamole, prasugrel, ticagrelor, ticlopidine, vorapaxar)\n* Implants that prohibit MRI measurements or trauma involving metal fragments\n* Pacemaker\n* History of clotting disorder (Deep venous thrombosis, pulmonary embolism) or bleeding disorder.\n* History of sever heart disease/disorders: coronary artery bypass graft (CABG) surgery, atrial fibrillation\n* Vascular stent: bare metal or any recently placed (within 6 months)\n* Current substance abuse\n* Institutionalization\n* Current participation in an interventional trial\n* Inability to provide informed consent without a proxy respondent\n* Non-English speaking\n* Any condition which in the judgement of the clinical investigator places the participant at risk from participation in the study.\n\nAdditional Criteria:\n\n* On chronic dialysis\n* Expectation to start dialysis within 6 months.\n* High dose antioxidants (Vitamine C, Vitamin E)\n* Baseline systolic blood pressure \\>170 or diastolic blood pressure \\>100\n* Uncontrolled diabetes with a HgbA1c \\>8.5\n* Active uncontrolled thyroid disease\n* Anemia (Hgb \\<9 g/dL)\n* Current substance abuse (i.e. amphetamine abuse)\n* Chronic opioid use (i.e. for chronic pain)\n* Chronic use of immunosuppressants\n* Active coronary ischemia detected by ECG on cycle ergometry VO2max testing. These individuals will be promptly referred to their primary care provider by the PI.",
      "sex": "ALL",
      "minimum_age": "30 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 30 and 75 years old?",
        "Have you been diagnosed with moderate-severe chronic kidney disease?",
        "Do you avoid regular exercise more than once a week?",
        "Do you avoid activities like brisk walking, jogging, or cycling more than once a week?",
        "Do you avoid muscle-strengthening exercises more than once a week?",
        "Do you avoid activities that make you sweat or breathe heavily more than once a week?",
        "Do you avoid exercise routines that last more than 60 minutes?",
        "Do you bike to work more than once a week?",
        "Do you take leisure walks without heavy breathing or sweating?",
        "Do you do both muscle-strengthening and endurance exercises once a week?"
      ],
      "exclusion": [
        "Have you ever had an organ transplant?",
        "Are you currently pregnant?",
        "Do you use a wheelchair or have a disability that prevents exercise?",
        "Do you rely on oxygen due to a lung condition?",
        "Do you get short of breath after walking less than 100 steps?",
        "Do you weigh more than 300 pounds?",
        "Have you been diagnosed with HIV or hepatitis?",
        "Have you been diagnosed with severe liver cirrhosis?",
        "Have you been diagnosed with active cancer other than skin cancer?",
        "Are you taking muscle relaxants regularly?",
        "Are you taking oral steroids equivalent to 10mg or more of prednisone daily?",
        "Are you taking antiviral medications?",
        "Are you taking oral calcineurin inhibitors?",
        "Are you taking antiepileptic drugs?",
        "Are you taking antipsychotics?",
        "Are you taking blood thinners or antiplatelets?",
        "Do you have implants that prevent MRI scans or metal fragments from trauma?",
        "Do you have a pacemaker?",
        "Have you been diagnosed with a clotting or bleeding disorder?",
        "Have you had heart surgery or atrial fibrillation?",
        "Have you had a vascular stent placed in the last 6 months?",
        "Are you currently abusing substances?",
        "Are you currently living in an institution?",
        "Are you participating in another clinical trial?",
        "Do you need someone else to provide consent for you?",
        "Do you speak a language other than English at home?",
        "Do you have any condition that a doctor thinks would put you at risk in this study?",
        "Are you on chronic dialysis?",
        "Do you expect to start dialysis within 6 months?",
        "Are you taking high doses of antioxidants like Vitamin C or E?",
        "Is your blood pressure often higher than 170/100?",
        "Have you been diagnosed with uncontrolled diabetes with HgbA1c >8.5?",
        "Have you been diagnosed with uncontrolled thyroid disease?",
        "Have you been diagnosed with anemia (Hgb <9 g/dL)?",
        "Are you currently abusing substances like amphetamines?",
        "Are you taking opioids regularly for chronic pain?",
        "Are you taking immunosuppressants regularly?",
        "Have you had active coronary ischemia detected by ECG?"
      ]
    }
  },
  {
    "nct_id": "NCT07003191",
    "title": "Multicenter, Prospective, Observational Study of Metformin Hydrochloride and Empagliflozin Tablets (Enshuangping) in the Treatment of Type 2 Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 4,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Age ≥ 18 years, gender unrestricted;\n2. Clinically diagnosed with type 2 diabetes;\n3. First-time treatment with metformin and empagliflozin tablets;\n4. HbA1c test results within 2 weeks prior to enrollment (rapid fingertip test results are acceptable);\n5. Voluntary participation in the study and signing of informed consent form.\n\nExclusion Criteria:\n\n1. Moderate to severe renal impairment (eGFR \\< 45 mL/min/1.73 m²), end-stage renal disease, or dialysis;\n2. Acute or chronic metabolic acidosis, including diabetic ketoacidosis;\n3. A history of severe allergy to empagliflozin, metformin, or any excipient in this product;\n4. Currently or within the past month, participation in any other clinical trials;\n5. Judged by the investigator to be unsuitable for participation in this study.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Have you been diagnosed with type 2 diabetes?",
        "Is this your first time taking metformin and empagliflozin tablets?",
        "Have you had an HbA1c test in the last 2 weeks?",
        "Are you willing to participate and sign the consent form?"
      ],
      "exclusion": [
        "Do you have moderate to severe kidney problems?",
        "Have you had acidosis or diabetic ketoacidosis?",
        "Are you allergic to empagliflozin, metformin, or any related ingredients?",
        "Have you participated in another clinical trial in the past month?",
        "Has a doctor told you that you should not participate in this study?"
      ]
    }
  },
  {
    "nct_id": "NCT07254689",
    "title": "A Produce Prescription Program Aimed at Reducing Food Insecurity and Type 2 Diabetes Risk Among Native American Older Adults",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 4,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Adults aged 55 years or older\n* Live on the Flathead Reservation\n* Self-identify as Native American (NA)\n* Food insecurity, as determined using Hunger Vital Sign™, a two question screener asked by providers.\n* Pre-diabetic, based on HbA1c lab results of (5.7-6.4%) or scores 5+ on the National Diabetes Prevention Programs screener based on health and history.\n\nExclusion Criteria:\n\n* Individuals with prevalent diabetes\n* Individuals with end-stage renal disease\n* Their health provider states they should not participate\n* If a participant is unable to communicate due to severe hearing loss or speech disorder, or severe visual impairment precluding them from completing assessment.",
      "sex": "ALL",
      "minimum_age": "55 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you 55 years or older?",
        "Do you live on the Flathead Reservation?",
        "Do you identify as Native American?",
        "Do you often worry about having enough food to eat?",
        "Have you ever been told you might get diabetes or have higher than normal blood sugar?"
      ],
      "exclusion": [
        "Have you been diagnosed with diabetes?",
        "Have you been diagnosed with severe kidney disease?",
        "Has your doctor said you should not join this program?",
        "Do you have severe hearing loss, speech disorder, or vision problems that make communication difficult?"
      ]
    }
  },
  {
    "nct_id": "NCT06440486",
    "title": "Based on a Randomized, Double-blind, Controlled Trial, Evaluate the Effects of Probiotics on Inflammation and Metabolism in Patients With Type 2 Diabetes Mellitus.",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 4,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Signed an informed consent form before the study and has a thorough understanding of the content, process, and possible adverse reactions of the study;\n2. Age 18 (inclusive) and above, gender not limited;\n3. Diagnosed with type 2 diabetes mellitus;\n4. Not diagnosed with cardiovascular, kidney, or any other diabetic complications.\n\nExclusion Criteria:\n\n1. Age over 75 years old;\n2. Use of exogenous insulin or patients with cardiovascular disease and other complications;\n3. Patients who are currently using α-glucosidase inhibitors;\n4. Patients who have a habit of taking probiotics or are currently taking probiotics;\n5. Pregnant or lactating women;\n6. Subjects deemed unsuitable for participation in this clinical study by the investigators due to other reasons.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you signed an informed consent form and understand the study?",
        "Are you 18 years old or older?",
        "Have you been diagnosed with type 2 diabetes?",
        "Have you been diagnosed with cardiovascular, kidney, or other diabetic complications?"
      ],
      "exclusion": [
        "Are you over 75 years old?",
        "Do you use insulin or have cardiovascular disease or other complications?",
        "Are you currently using α-glucosidase inhibitors?",
        "Do you regularly take probiotics?",
        "Are you pregnant or breastfeeding?",
        "Have the investigators told you that you are not suitable for this study?"
      ]
    }
  },
  {
    "nct_id": "NCT06003153",
    "title": "GLUCOSE-MGH: Genetic Links Understood Through Challenge With Oral Semaglutide Exposure at MGH",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 4,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Males or non-pregnant females\n2. Ages 18-50 (inclusive)\n3. Able/willing to give consent\n4. Span the metabolic range between normal glycemia and pre-diabetes (fasting glucose of 100-125 mg/dL based on chart review of existing laboratory data)\n\nExclusion Criteria:\n\n1. Currently taking medications or intending to take medications for diabetes\n2. Currently taking medications or intending to take medications that affect glycemic parameters, such as glucocorticoids, growth hormone, or fluoroquinolones\n3. Personal history of intestinal malabsorption, bariatric surgery, celiac disease, gallbladder disease, or pancreatitis\n4. Personal or family history of medullary thyroid cancer or multiple endocrine neoplasia type 2\n5. Estimated glomerular filtration rate (eGFR) \\<60 ml/min/1.73 m2 per the Modification of Diet in Renal Disease equation\n6. History of cirrhosis and/or aspartate aminotransferase or alanine aminotransferase more than 3x upper limit of normal\n7. Dietary restrictions preventing consumption of a MMTT\n8. Women who are pregnant, nursing, or at risk of becoming pregnant\n9. Participation in other interventional studies during the current study",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "50 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you a male or a non-pregnant female?",
        "Are you between 18 and 50 years old?",
        "Are you able and willing to give consent?",
        "Do you have a fasting glucose level between 100 and 125 mg/dL?"
      ],
      "exclusion": [
        "Are you currently taking medications for diabetes?",
        "Are you taking medications that affect blood sugar, like steroids or antibiotics?",
        "Have you ever had intestinal problems, stomach surgery, or pancreas issues?",
        "Have you or your family had thyroid cancer or specific endocrine tumors?",
        "Do you have kidney problems with filtration rate less than 60?",
        "Have you had liver cirrhosis or very high liver enzymes?",
        "Do you have dietary restrictions that prevent you from eating a meal test?",
        "Are you pregnant, nursing, or at risk of becoming pregnant?",
        "Are you participating in another medical study right now?"
      ]
    }
  },
  {
    "nct_id": "NCT06926842",
    "title": "A Randomized, Double-Blind, Phase 2 Trial of Once-Weekly Petrelintide Compared With Placebo in Participants With Overweight or Obesity and Type 2 Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Main Inclusion Criteria:\n\n* Male or female participants with body mass index (BMI) ≥27.0 kg/m2.\n* Diagnosed with type 2 diabetes ≥180 days prior to the day of screening.\n* Treated with metformin with or without sodium-glucose cotransporter 2 inhibitors. Treatment should be stable (same drug\\[s\\], dose, and dosing frequency) for at least 90 days prior to screening.\n\nMain Exclusion Criteria:\n\n* Severe hypoglycemia within 6 months prior to screening or history of hypoglycemia unawareness.\n* Receipt of any other glucose-lowering drug than those listed in the inclusion criterion within 90 days prior to screening.\n* A self-reported change in body weight \\>5% within 90 days prior to screening, irrespective of medical records.\n* Treatment with any medication (prescribed or over-the-counter) or alternative remedies (herbal or nutritional supplements) intended to promote weight loss within 90 days prior to screening.\n* Previous or planned (during the trial period) obesity treatment with surgery or a body weight loss device. However, liposuction or surgical removal of fat depots more than 1 year prior to screening or device-based interventions (e.g., sleeve, banding, or similar) that have been removed more than 6 months prior to screening, are allowed.\n* Obesity due to endocrine disorders or genetic syndromes.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Is your body mass index (BMI) 27 or higher?",
        "Have you been diagnosed with type 2 diabetes more than 6 months ago?",
        "Are you currently taking metformin with or without sodium-glucose cotransporter 2 inhibitors?",
        "Have you been on the same diabetes medication and dose for at least 3 months?"
      ],
      "exclusion": [
        "Have you had severe low blood sugar in the last 6 months?",
        "Do you often have low blood sugar without realizing it?",
        "Have you taken any glucose-lowering drugs not mentioned in the inclusion criteria in the last 3 months?",
        "Have you had a change in body weight of more than 5% in the last 3 months?",
        "Have you taken any medication or supplement to lose weight in the last 3 months?",
        "Have you ever had or planned to have obesity surgery or use a weight loss device?",
        "Is your obesity due to hormonal disorders or genetic syndromes?",
        "Have you had liposuction or fat removal surgery in the last year?",
        "Have you had any device-based weight loss interventions removed in the last 6 months?"
      ]
    }
  },
  {
    "nct_id": "NCT06996405",
    "title": "EFFECT Diet - Cluster RCT and Qualitative Inquiry",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "kidney"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion criteria:\n\n* Able to understand Danish\n* Chronic dialysis treatment (min. 3 month)\n\nExclusion criteria:\n\n* Dementia\n* Not able to sign a consent form\n* Expected short duration of life, eg. terminal cancer",
      "sex": "ALL",
      "minimum_age": "N/A",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Do you understand Danish?",
        "Have you been on dialysis treatment for at least 3 months?"
      ],
      "exclusion": [
        "Have you been diagnosed with dementia?",
        "Are you unable to sign a consent form?",
        "Have you been told you have a short time to live, such as terminal cancer?"
      ]
    }
  },
  {
    "nct_id": "NCT06913101",
    "title": "Comparison of Efficacy of Once Weekly Dose of Trelagliptin Versus Once Daily Dose of Vildagliptin on the Levels of HbA1c in Type-2 Diabetes Patients",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Adults aged 30-60 years.\n* Both male and female.\n* Diagnosed with type 2 diabetes mellitus.\n* HbA1c levels between 7.5% and 9.5% at screening.\n* Able to provide informed consent.\n\nExclusion Criteria:\n\n* Type 1 diabetes mellitus or a history of ketoacidosis.\n* Use of insulin or any antidiabetic drugs other than metformin within 3 months prior to the start of the study.\n* Significant cardiovascular disease, including recent myocardial infarction (within the last 6 months), unstable angina, or uncontrolled hypertension.\n* Chronic kidney disease (stage 3 or worse) or hepatic or pancreatic dysfunction.\n* Pregnant or breastfeeding or planning to become pregnant during the study duration.\n* Participation in another clinical trial within 30 days prior to enrollment.\n* Known hypersensitivity to trelagliptin, vildagliptin, or any components of their formulations.\n* Any medical or psychological condition which in the opinion of the investigator would not permit the patient to complete the study.\n* Participants for whom blood sugar control by insulin preparations is desired (for example, participants with severe ketosis, diabetic coma or precoma, type 1 diabetes mellitus, severe infection, or serious trauma before or after surgery).\n* Participants with unstable proliferative diabetic retinopathy.",
      "sex": "ALL",
      "minimum_age": "30 Years",
      "maximum_age": "60 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 30 and 60 years old?",
        "Have you been diagnosed with type 2 diabetes?",
        "Are your HbA1c levels between 7.5% and 9.5%?",
        "Can you provide informed consent?"
      ],
      "exclusion": [
        "Have you been diagnosed with type 1 diabetes?",
        "Have you ever had ketoacidosis?",
        "Have you used insulin or other diabetes drugs besides metformin in the last 3 months?",
        "Have you had a heart attack in the last 6 months?",
        "Do you have unstable angina or uncontrolled high blood pressure?",
        "Do you have chronic kidney disease or liver or pancreas problems?",
        "Are you pregnant, breastfeeding, or planning to become pregnant?",
        "Have you participated in another clinical trial in the last 30 days?",
        "Are you allergic to trelagliptin, vildagliptin, or any of their ingredients?",
        "Do you have any medical or psychological condition that would prevent you from completing the study?",
        "Do you need insulin to control your blood sugar?",
        "Have you ever had severe ketosis, diabetic coma, or severe infection?",
        "Have you had serious trauma or surgery recently?",
        "Do you have unstable proliferative diabetic retinopathy?"
      ]
    }
  },
  {
    "nct_id": "NCT06408532",
    "title": "The Evaluation of the Efficacy and Safety of Switching to Once-daily IDegLira in Patients With Type 2 Diabetes Receiving Premixed Insulin Therapy, a Multi-center, Randomized Control Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Diagnosed with type 2 diabetes for ≥3 months. Meets the diabetes diagnostic criteria established by the World Health Organization (WHO) in 1999.\n* Age ≥18 years, regardless of gender.\n* Body mass index ≥23.0 kg/m\\^2.\n* HbA1c ≥7.5% and ≤11.0% at screening.\n* Concurrently taking metformin, with a metformin dose ≥1500 mg/day or the maximum tolerated dose (not less than 1000 mg/day), and may be combined with oral sodium-glucose cotransporter-2 inhibitors, thiazolidinediones, or alpha-glucosidase inhibitors. Combination oral medications must be at a stable dose for ≥8 weeks and continued during the study period.\n* For 8 weeks prior to screening, has been on a stable, regular regimen of premixed human insulin (including premixed insulin analogs) administered subcutaneously twice daily, with a total daily insulin dose of 15-50 units, in addition to diet and exercise control.\n* Has signed the informed consent form.\n* Willing and able to self-monitor blood glucose (SMBG) and record the diary card on time.\n* Fully understands the study purpose and can communicate well with the investigator, and can understand and comply with all requirements of this study.\n\nExclusion Criteria:\n\n* Subjects who have previously tested positive for diabetes autoantibodies (including anti-glutamic acid decarboxylase antibodies, anti-islet cell antibodies, anti-insulin antibodies, anti-zinc transporter 8 antibodies, and anti-protein tyrosine phosphatase antibodies).\n* Fasting C-peptide level ≤0.6 ng/mL.\n* Used a glucagon-like peptide-1 (GLP-1) receptor agonist within the 3 months prior to screening.\n* Concomitant use of sulfonylureas, glinides, and dipeptidyl peptidase-4 inhibitors within the 3 months prior to screening.\n* History of medullary thyroid carcinoma, multiple endocrine neoplasia type 2, or a family history of these conditions.\n* History of acute/chronic pancreatitis.\n* Experienced a serious gastrointestinal disease (such as active ulcer) or underwent gastrointestinal surgery (except appendectomy or cholecystectomy) or had clinically significant gastric emptying abnormalities (such as pyloric obstruction, gastroparesis) or long-term use of medications that directly affect gastrointestinal motility, or deemed unsuitable for the study by the investigator within the 3 months prior to screening.\n* Concurrent severe diseases, including but not limited to severe cardiovascular, cerebrovascular, hepatic, or renal diseases, or severe diabetes-related complications, and deemed unsuitable for the study by the investigator.\n* Pregnant or breastfeeding female subjects, or subjects (including male subjects' female partners) with plans for pregnancy or sperm/egg donation within 3 months after the last dose, or unwilling to use at least one effective contraceptive method or device.\n* Unwilling to wear an invasive monitoring device.\n* Clear reasons that prevent the use of continuous glucose monitoring (CGM), such as severe allergy or skin conditions, and deemed unsuitable for the study by the investigator.\n* Subjects with skin lesions, scarring, redness, infection, or edema at the sensor application site that may affect the accuracy of sensor placement or interstitial glucose measurement.\n* Received long-term (continuous or cumulative ≥7 days) treatment with systemic corticosteroids or growth hormone that may affect blood glucose within 1 month prior to screening.\n* History of malignancy within the past 3 years, excluding basal cell carcinoma, squamous cell carcinoma, and any in situ cancers.\n* Participated in another drug or medical device clinical trial (except for registry studies) within the 3 months prior to screening.\n* Presence of severe psychiatric disorders or language barriers, unwilling or unable to fully understand and cooperate.\n* Experienced diabetic ketoacidosis (DKA), hyperosmolar hyperglycemic state (HHS), or lactic acidosis (LAD) within the 3 months prior to screening.\n* Fasting triglycerides \\>5.65 mmol/L (can be retested within one week) at screening.\n* History of alcohol or drug abuse (more than 14 units of alcohol per week \\[1 unit = 360 mL of 5% beer, or 45 mL of 40% spirits, or 150 mL of 12% wine\\]).\n* Known or suspected allergy to GLP-1 class drugs or excipients.\n* Any other reason deemed by the investigator to make the subject unsuitable for participation in the study.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with type 2 diabetes for at least 3 months?",
        "Are you 18 years or older?",
        "Is your body mass index 23.0 or higher?",
        "Is your HbA1c between 7.5% and 11.0%?",
        "Are you currently taking metformin with a dose of at least 1500 mg/day?",
        "Have you been on a stable insulin regimen for the past 8 weeks?",
        "Are you willing to monitor your blood sugar and record it daily?",
        "Do you understand the study and can follow all its requirements?"
      ],
      "exclusion": [
        "Have you ever tested positive for diabetes autoantibodies?",
        "Is your fasting C-peptide level 0.6 ng/mL or lower?",
        "Have you used GLP-1 receptor agonist in the last 3 months?",
        "Have you used sulfonylureas, glinides, or dipeptidyl peptidase-4 inhibitors in the last 3 months?",
        "Have you had thyroid cancer or a family history of it?",
        "Have you had pancreatitis?",
        "Have you had serious stomach or gut issues in the last 3 months?",
        "Do you have severe heart, liver, or kidney disease?",
        "Are you pregnant, breastfeeding, or planning to become pregnant?",
        "Are you unwilling to wear a monitoring device?",
        "Do you have skin issues that could affect sensor placement?",
        "Have you used corticosteroids or growth hormone in the last month?",
        "Have you had cancer in the past 3 years, excluding some skin cancers?",
        "Have you participated in another clinical trial in the last 3 months?",
        "Do you have severe psychiatric disorders or language barriers?",
        "Have you had diabetic ketoacidosis, hyperosmolar hyperglycemic state, or lactic acidosis in the last 3 months?",
        "Are your fasting triglycerides higher than 5.65 mmol/L?",
        "Have you abused alcohol or drugs?",
        "Are you allergic to GLP-1 class drugs?"
      ]
    }
  },
  {
    "nct_id": "NCT06474598",
    "title": "A Open Label, Parallel Group Phase IIA, Adaptive Design Study of MTX228 in Adult Subjects With Type 1 Diabetes and Preserved β-Cell Function",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* clinical diagnosis of T1DM with onset before the age of 35 requiring continuous treatment with insulin within 1 year of diagnosis and the presence of positive T1DM autoantibody titer if diagnosed after age 35 (past or present\n* HbA1c between 6.0 - 10.0 %.\n* Willing to wear study-provided CGM and share CGM data via cloud.\n* Diagnosis of T1DM ≥1year at time of screening.\n* Fasting or random (post-prandial) C-peptide level ≥ 100 pmol/l (or 0.3 ng/mL) during screening or pre-screening. Pre-screening C-peptide levels may be obtained by the study team (subject to patient's written consent) up to 56 days before planned enrolment to reduce the number of screen failures.\n* BMI ≤ 35 kg/m2\n* eGFR \\>45 ml/min/1.73m2\n* Able and willing to comply with the study protocol for the duration of the study\n* Written informed consent must be obtained before any study-related assessment is performed.\n\nExclusion Criteria:\n\n* Diagnosis or history indicative of monogenic, Type 2 or post-pancreatectomy diabetes\n* History of \\>1 episode of severe (level 3) hypoglycemia in the prior 6 months\n* Significant cardiovascular history defined as:\n\n  1. History of myocardial infarction, coronary angioplasty or bypass grafts, valvular disease or repair, unstable angina pectoris, transient ischemic attack, or cerebrovascular accidents within six months prior to entry into the study\n  2. Congestive heart failure defined as New York Heart Association (NYHA) stage III and IV\n  3. Uncontrolled hypertension defined as SBP \\> 160 mmHg and/or DBP \\> 100 mmHg\n  4. Symptomatic postural hypotension\n  5. Use of systemic corticosteroids (except physiologic replacement doses for adrenal insufficiency) or other medications that would influence insulin sensitivity\n  6. Use of non-insulin antihyperglycemic agents within prior 30 days.\n  7. History of significant other major or unstable neurological, metabolic, hepatic, renal, hematological, pulmonary, cardiovascular, gastrointestinal, or urological disorder including previous solid organ or cell transplant that would impact patient safety or data interpretation.\n  8. History of cancer, other than squamous cell or basal cell carcinoma of the skin, that has not been in full remission for at least 5 years before screening (any history of treated cervical intraepithelial neoplasia is allowed)\n  9. Known recreational substance use or psychiatric illness that, in the opinion of the Investigator, may impact the safety of the subject or objectives with scheduled visits\n  10. A history of alcohol or drug abuse or drug addiction in the previous 12 months\n  11. A positive pregnancy blood test for women of childbearing age or breast-feeding women 12 Are unwilling to use an \"effective\" method of contraception during the course of the study. Sexually active male patients, who could have children, are required to use a condom or abstained from intercourse, and refrain from sperm donation for the purposes of conception. Females have to be surgically sterile (via hysterectomy or bilateral tubal ligation) or post-menopausal or using a medically acceptable barrier method of contraception (i.e. IUD, barrier methods with spermicide or abstinence).",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "65 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Were you diagnosed with type 1 diabetes before age 35?",
        "Have you been treated with insulin since your diagnosis?",
        "Is your HbA1c between 6.0 and 10.0%?",
        "Are you willing to wear a glucose monitor and share its data?",
        "Have you been diagnosed with type 1 diabetes for at least 1 year?",
        "Is your C-peptide level 100 pmol/l or higher?",
        "Is your BMI 35 or less?",
        "Is your kidney function (eGFR) greater than 45 ml/min/1.73m2?",
        "Are you able and willing to follow the study protocol?",
        "Are you willing to provide written informed consent?"
      ],
      "exclusion": [
        "Have you been diagnosed with any type of diabetes other than type 1?",
        "Have you had more than one severe low blood sugar episode in the past 6 months?",
        "Have you had a heart attack, stroke, or heart surgery in the past 6 months?",
        "Do you have severe heart failure?",
        "Do you have uncontrolled high blood pressure?",
        "Do you have symptoms of low blood pressure when standing up?",
        "Have you used steroid medications or other drugs that affect insulin sensitivity?",
        "Have you used non-insulin diabetes medications in the past 30 days?",
        "Do you have any major or unstable medical conditions?",
        "Have you had cancer that is not in full remission for at least 5 years?",
        "Do you use recreational drugs or have a psychiatric illness that may affect your safety?",
        "Have you had issues with alcohol or drug abuse in the past 12 months?",
        "Are you pregnant or breastfeeding?",
        "Are you unwilling to use effective contraception during the study?"
      ]
    }
  },
  {
    "nct_id": "NCT06784375",
    "title": "Personalized Nutrition Using Continuous Glucose Monitoring to Improve Outcomes in Type 2 Diabetes Mellitus",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* at least 18 years of age\n* previous diagnosis of T2DM\n* HbA1c of 6.8-8.5%\n\nExclusion Criteria:\n\n* type 1 diabetes mellitus\n* treatment with insulin, sulfonylurea, or meglitinide\n* use of nondiabetic medications that affect blood glucose control (such as corticosteroids)\n* BMI \\<25 kg/m2 or \\<23 kg/m2 for participants who self-identify as Asian\n* weight change \\>5 pounds in the 3 months prior to study enrollment\n* estimated glomerular filtration rate \\<60 ml/minute/1.73 m2\n* pregnancy or immediate plans to become pregnant 8) breastfeeding 9) anemia (which would affect measurement of HbA1c) 10) changes to glucose lowering medications, including change in dose, in the 3 months prior to enrollment 11) presence of any disease that would make adherence to the protocol difficult.\"",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you at least 18 years old?",
        "Have you been diagnosed with type 2 diabetes before?",
        "Is your HbA1c between 6.8% and 8.5%?"
      ],
      "exclusion": [
        "Have you been diagnosed with type 1 diabetes?",
        "Are you currently taking insulin?",
        "Are you currently taking sulfonylurea or meglitinide?",
        "Are you taking any non-diabetic medications that affect blood sugar?",
        "Is your BMI less than 25? If you are Asian, is your BMI less than 23?",
        "Have you lost or gained more than 5 pounds in the last 3 months?",
        "Have you been told your kidney function is low?",
        "Are you pregnant or planning to become pregnant soon?",
        "Are you currently breastfeeding?",
        "Have you been diagnosed with anemia?",
        "Have you changed your diabetes medication or dose in the last 3 months?",
        "Do you have any other health conditions that might make it hard to follow the study rules?"
      ]
    }
  },
  {
    "nct_id": "NCT06495177",
    "title": "European Survey of Cardiovascular Disease Prevention, Diabetes and Chronic Kidney Disease",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "kidney"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Patients having signed an informed Consent\n* Patients aged from 18 years old at the time of identification\n* At least six and at most 24 months elapsed between the index event (the recruiting diagnostic or treatment criteria below) and the date of interview\n* Patients meeting the recruiting diagnostic or treatment criteria:\n* Coronary patients: Acute coronary events (acute coronary syndrome {STEMI or NSTEMI}, unstable angina) or an emergency or elective revascularisation for coronary artery disease (CABG, PCI)\n* High cardiovascular disease (CVD) risk patients: patients free of CVD, who have been prescribed one or more of the following treatments: blood pressure and/or lipid-lowering and/or glucose lowering (diet and/or hypoglycaemic agents and/or insulin)\n\nExclusion Criteria:\n\n* Patients living outside defined geographical areas\n* Patients admitted to hospital from outside the geographical area or under the care of cardiologists in hospitals that do not participate in EUROASPIRE VI",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you signed an informed consent form?",
        "Are you 18 years old or older?",
        "Has it been between 6 and 24 months since your heart event or treatment?",
        "Have you had a heart attack or severe chest pain recently?",
        "Have you had an emergency or planned heart surgery recently?",
        "Are you taking medicine for high blood pressure, cholesterol, or diabetes?"
      ],
      "exclusion": [
        "Do you live outside the study's geographical area?",
        "Were you admitted to a hospital outside the study's geographical area?",
        "Are you under the care of a heart doctor in a non-participating hospital?"
      ]
    }
  },
  {
    "nct_id": "NCT06897202",
    "title": "A Phase 2b, Multi-Center, Randomized, Double-Blind, Placebo-Controlled Study to Evaluate the Efficacy and Safety of Once-Weekly MET097 in Adults With Obesity or Overweight, and Type 2 Diabetes Mellitus (VESPER-2)",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* BMI ≥27.0 kg/m2 to ≤50.0 kg/m2 at screening\n* Type 2 diabetes mellitus (\\*T2DM) for at least 3 months before screening\n* Glycated hemoglobin (HbA1c) value between ≥7.0% (53.0 mmol/mol) and ≤10.5% (91.3 mmol/mol) at Screening and treated with stable therapy for at least 30 days prior to Screening/Visit 1 (diet and exercise alone or in combination with metformin monotherapy and/or SGLT-2)\n* Stable body weight (increase or decrease ≤5 kg) within 3 months prior to screening\n\nExclusion Criteria:\n\n* Female who is lactating or who is pregnant\n* Estimated glomerular filtration rate (eGFR) \\<60 mL/min/1.73 m2\n* Fasting triglycerides ≥ 5.6 mmol/L (≥500 mg/dL)\n* Poorly controlled hypertension\n* History of stroke\n* Significant cardiovascular disease including but not limited to unstable angina or valvular heart disease or has a history of myocardial infarction, coronary artery bypass graft, percutaneous coronary artery re-vascularization, or congestive heart failure\n* Diagnosis of Type 1 diabetes (history of ketoacidosis, hyperosmolar state/coma, or any other types of diabetes except T2DM)\n* History of acute or chronic pancreatitis\n* Family or personal history of medullary thyroid carcinoma (MTC) or multiple endocrine neoplasia syndrome type 2 (MEN-2)\n* History of significant active or unstable major depressive disorder (MDD) or other severe psychiatric disorder within the last 2 years\n* Relevant surgical history including all bariatric or weight loss surgeries\n* SGLT2 inhibitors and/or metformin\n* Had 1 or more episodes of hypoglycemia",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "75 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Is your BMI between 27.0 and 50.0?",
        "Have you had type 2 diabetes for at least 3 months?",
        "Is your HbA1c value between 7.0% and 10.5%?",
        "Have you been on stable diabetes treatment for at least 30 days?",
        "Has your body weight changed by less than 5 kg in the last 3 months?"
      ],
      "exclusion": [
        "Are you pregnant or breastfeeding?",
        "Do you have a kidney function (eGFR) less than 60 mL/min/1.73 m2?",
        "Do you have fasting triglycerides greater than or equal to 5.6 mmol/L?",
        "Do you have poorly controlled high blood pressure?",
        "Have you ever had a stroke?",
        "Do you have significant heart disease or history of heart problems?",
        "Have you been diagnosed with Type 1 diabetes?",
        "Have you ever had pancreatitis?",
        "Do you or your family have a history of medullary thyroid carcinoma or MEN-2?",
        "Have you had significant depression or other severe psychiatric disorder in the last 2 years?",
        "Have you had weight loss surgery?",
        "Are you taking SGLT2 inhibitors and/or metformin?",
        "Have you had one or more episodes of hypoglycemia?"
      ]
    }
  },
  {
    "nct_id": "NCT03842475",
    "title": "Who Will Benefit From Bariatric Surgery for Diabetes? Using Fat Distribution Measurement, Gut Hormone Profiles and Genetic Data to Predict Diabetes Remission",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Bariatric surgery group\n\nInclusion Criteria:\n\n* Males and females planning to undergo RYGB\n* 18-80 years\n* Type 2 diabetes mellitus or prediabetes\n* Stable weight for at least 3 months\n* Obese (BMI ≥30kg/m2)\n* Eligible for surgery on the National Health Service (NHS) under The National Institute for Health and Care Excellence (NICE) 2014 criteria\n\nExclusion Criteria:\n\n* Current pregnancy\n* Inability to give informed consent\n* Type 1 diabetes\n* Low fasting C-peptide\n* Secondary diabetes or absence of β-cell function\n* Unable to undergo DEXA, cirrhosis, ascites, or other condition that may modify body fat composition e.g. underlying malignancy\n* Current smoker\n* Participation in another (interventional) trial within the last 3 months\n* Unable to understand English\n\nHealthy volunteers\n\nInclusion criteria:\n\n* Aged 18-80 years\n* Male or female\n* Body mass index 19 - 25 kg/m2\n* Stable weight for at least three months\n\nExclusion criteria:\n\n* Abnormal glucose tolerance and fasting glucose\n* History of any medical, or other condition, or use of any medications, including over-the-counter products, which, in the opinion of the investigators, would either interfere with the study\n* Without access at home to a telephone, or other factor likely to interfere with ability to participate reliably in the study\n* Pregnancy or breastfeeding\n* Unable to maintain adequate contraception for the duration of the study\n* Donated blood during the preceding 3 months or intention to do so before the end of the study\n* Current smoker\n* Participation in another trial within the last 3 months\n* Unable to understand English",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "80 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you planning to have RYGB surgery?",
        "Are you between 18 and 80 years old?",
        "Have you been diagnosed with type 2 diabetes or prediabetes?",
        "Has your weight been stable for at least 3 months?",
        "Is your BMI 30 or higher?",
        "Are you eligible for surgery on the NHS under NICE 2014 criteria?",
        "Is your BMI between 19 and 25?",
        "Are you a male or female?"
      ],
      "exclusion": [
        "Are you currently pregnant?",
        "Are you unable to give informed consent?",
        "Have you been diagnosed with type 1 diabetes?",
        "Do you have low fasting C-peptide?",
        "Have you been diagnosed with secondary diabetes?",
        "Are you unable to undergo a DEXA scan?",
        "Have you been diagnosed with cirrhosis?",
        "Have you been diagnosed with ascites?",
        "Do you have a condition that may change body fat composition?",
        "Do you have an underlying malignancy?",
        "Are you a current smoker?",
        "Have you participated in another trial within the last 3 months?",
        "Are you unable to understand English?",
        "Have you been diagnosed with abnormal glucose tolerance?",
        "Do you have a history of any medical condition that may interfere with the study?",
        "Do you take any medications that may interfere with the study?",
        "Do you not have access to a telephone at home?",
        "Are you currently breastfeeding?",
        "Are you unable to maintain adequate contraception for the duration of the study?",
        "Have you donated blood during the preceding 3 months?",
        "Do you intend to donate blood before the end of the study?"
      ]
    }
  },
  {
    "nct_id": "NCT06547541",
    "title": "Exercise Training During Hospitalization in Patients with Type 2 Diabetes - a Phase 1 Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* T2D or prediabetes defined as at least one of the following\n\n  * ICD-10 diagnosis of T2D (DE11.x)\n  * HbA1c \\> 48 at time of admission\n  * Use of type 2 antidiabetic medicine (excluding SGLT2 inhibitors)\n  * HbA1c ≥ 42 within 3 months of admission (prediabetes)\n* Hospitalized with an infection\n* Expected residual hospitalization time of at least three days\n* At least 18 years of age\n* Able to perform exercises in the booklet \"Syg men sun dog aktiv\"\n\nExclusion Criteria:\n\n* Admitted to the hospital more than 5 days ago\n* Unable to give written consent to participate\n* Terminal illness\n* Unstable or new onset angina\n* Ventricular arrhythmia\n* Aortic stenosis\n* Sternotomy in conjunction with the current hospitalization\n* Blood pressure greater than 180/120 mmHg\n* Kidney failure requiring dialysis\n* Unable to follow the 3-stage command of the Mini-Mental State Examination\n* Known allergy or contact dermatitis to tape, and CGMs",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with type 2 diabetes?",
        "Has your HbA1c level been greater than 48 at the time of admission?",
        "Are you taking medicine for type 2 diabetes, excluding SGLT2 inhibitors?",
        "Has your HbA1c level been 42 or higher within the last 3 months?",
        "Are you currently in the hospital for an infection?",
        "Do you expect to stay in the hospital for at least three more days?",
        "Are you at least 18 years old?",
        "Can you perform exercises from the booklet 'Syg men sun dog aktiv'?"
      ],
      "exclusion": [
        "Have you been in the hospital for more than 5 days?",
        "Are you unable to give written consent to participate?",
        "Have you been diagnosed with a terminal illness?",
        "Do you have unstable or new chest pain?",
        "Have you been diagnosed with ventricular arrhythmia?",
        "Have you been diagnosed with aortic stenosis?",
        "Have you had sternotomy during this hospital stay?",
        "Is your blood pressure greater than 180/120 mmHg?",
        "Do you have kidney failure requiring dialysis?",
        "Are you unable to follow a 3-step command?",
        "Do you have an allergy or skin reaction to tape or glucose monitors?"
      ]
    }
  },
  {
    "nct_id": "NCT05501483",
    "title": "Adipose Tissue Heterogeneity and Its Link to Type 2 Diabetes: A Randomized Open Intervention Study That Compares Empagliflozin, Pioglitazone and Semaglutide",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Signed informed consent\n* BMI 25 kg/m2 or higher\n* HbA1c 42 mmol/mol or higher\n* For fertile women, effective contraception\n\nExclusion Criteria:\n\n* HbA1c 65 mmol/mol or higher\n* Established cardiovascular disease and/or heart failure\n* Severe psychiatric condition\n* Active alcoholism\n* Insulin treatment\n* Anticoagulant therapy (vitamin K antagonists or equivalent)\n* Pregnancy, lactation\n* Positive GAD or IA2 antibodies\n* Low C-peptide/glucose ratio (less than 2 measured as pmol/mg per dL)\n* NT-proBNP above the upper normal reference value\n* Kidney disease\n* Liver disease or hepatic values over twice the upper reference value\n* Severe concomitant disease including ongoing cancer",
      "sex": "ALL",
      "minimum_age": "30 Years",
      "maximum_age": "70 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Have you signed the informed consent form?",
        "Is your BMI 25 or higher?",
        "Is your HbA1c level 42 or higher?",
        "Are you using effective contraception? (for fertile women)"
      ],
      "exclusion": [
        "Is your HbA1c level 65 or higher?",
        "Have you been diagnosed with heart disease or heart failure?",
        "Do you have a severe psychiatric condition?",
        "Do you currently struggle with alcoholism?",
        "Are you currently on insulin treatment?",
        "Are you taking blood-thinning medication?",
        "Are you pregnant or breastfeeding?",
        "Have you tested positive for GAD or IA2 antibodies?",
        "Is your C-peptide/glucose ratio less than 2?",
        "Is your NT-proBNP level above the normal range?",
        "Do you have kidney disease?",
        "Do you have liver disease or high liver values?",
        "Do you have any other severe medical conditions, including cancer?"
      ]
    }
  },
  {
    "nct_id": "NCT04625751",
    "title": "Unravelling the Association Between Neurovascular Uncoupling and Autonomic Neuropathy in Patients With Type 2 Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* A diagnosis of type 2 diabetes (Patients)\n* Age between 50-70 years (All)\n* Presence of CAN as diagnosed by cardiovascular reflex tests with two or three pathological results (Patients with CAN only)\n* Exclusion of CAN as diagnosed by cardiovascular reflex tests with no pathological results (Patients without CAN and HC only)\n\nExclusion Criteria:\n\n* Participants receiving treatment with direct effects on noradrenergic or cholinergic signaling (for example beta-blockers, tricyclic antidepressants, SSRI's) (All)\n* Acute infections (All)\n* Thyroid disease (All)\n* Substance or alcohol abuse (All)\n* Atrial fibrillation or flutter (All)\n* Respiratory failure (All)\n* Participants in active laser treatment for retinopathy, will be excluded from the Valsalva test (Patients)\n* Non-diabetic causes of neuropathy including a medical history of vitamin B12 deficiency, folic acid deficiency, rheumatoid arthritics, amyloidosis, HIV, syphilis, Borreliosis, drug induced neuropathy and neuropathy caused by toxins (All)\n* Claustrophobia (All)\n* Implanted pacemakers or remaining pacemaker electrodes (All)\n* Previous heart or brain surgery with use of metal clips (All)\n* Any form of non-MR-compatible implants\n* Non-compliance with the study protocol as judged by the investigators (All)\n* Concurrent participation in an intervention study (Patients)\n* Participants who by judgments of the investigator, is incapable of participating (All)",
      "sex": "ALL",
      "minimum_age": "50 Years",
      "maximum_age": "70 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Have you been diagnosed with type 2 diabetes?",
        "Are you between 50 and 70 years old?",
        "Have you been diagnosed with CAN by heart tests with two or three abnormal results?",
        "Have heart tests shown that you do not have CAN?"
      ],
      "exclusion": [
        "Are you taking medicines that affect certain nerve signals, like beta-blockers or antidepressants?",
        "Do you currently have an acute infection?",
        "Have you been diagnosed with thyroid disease?",
        "Have you ever had issues with substance or alcohol abuse?",
        "Have you been diagnosed with atrial fibrillation or flutter?",
        "Have you been diagnosed with respiratory failure?",
        "Are you currently receiving active laser treatment for retinopathy?",
        "Have you had neuropathy caused by something other than diabetes?",
        "Do you have claustrophobia?",
        "Do you have an implanted pacemaker or remaining pacemaker electrodes?",
        "Have you had heart or brain surgery with metal clips?",
        "Do you have any implants that are not MRI compatible?",
        "Are you unable to follow the study protocol as judged by the investigators?",
        "Are you currently participating in another intervention study?",
        "Do the investigators believe you are incapable of participating in this study?"
      ]
    }
  },
  {
    "nct_id": "NCT04835493",
    "title": "Evaluating Telementoring to Initiate a Multidimensional Diabetes Program for Latino(a)s in Community Clinics: A Randomized Clinical Trial",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* self-identified Latino(a)\n* Spanish-speaking\n* \\>/=18 years\n* type 2 diabetes (T2D), e.g., HbA1c \\>/=6.5%, provider documented T2D, on oral anti-hyperglycemic\n* uninsured, \\<150% federal poverty level\n\nExclusion Criteria:\n\n* no show to all group visits\n* condition that may alter HbA1c levels, e.g., recent blood transfusion\n* patients at high-risk or not appropriate for care in a group setting e.g., pregnancy, severe cognitive impairment, frequent clinic appointments for labile glucose/medication titration e.g., insulin.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Do you identify as Latino or Latina?",
        "Do you speak Spanish?",
        "Are you 18 years old or older?",
        "Have you been diagnosed with type 2 diabetes?",
        "Is your HbA1c level 6.5% or higher?",
        "Are you currently taking medication for high blood sugar?",
        "Are you uninsured?",
        "Is your income below 150% of the federal poverty level?"
      ],
      "exclusion": [
        "Have you missed all your group visits in the past?",
        "Have you had a blood transfusion recently?",
        "Are you currently pregnant?",
        "Do you have severe memory or thinking problems?",
        "Do you need frequent clinic visits for blood sugar control?",
        "Are you taking insulin for your diabetes?"
      ]
    }
  },
  {
    "nct_id": "NCT06945406",
    "title": "A Phase 1 Study to Assess the Safety, Tolerability, Pharmacokinetics, and Pharmacodynamics of LY4057996 in Healthy Participants and Participants With Type 1 and Type 2 Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 3,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\nPart A for Healthy Participants:\n\n* Are overtly healthy as determined by medical evaluation, including medical history, physical exam, laboratory tests, and cardiac screening assessment\n\nPart A for Type 2 Diabetes (T2DM) Participants:\n\n* Are participants with T2DM diagnosed greater than 1 year before enrollment,\n* On basal insulin therapy, insulin glargine, or insulin degludec, greater than 10 units per day for at least 6 months (for Cohort 5 only)\n* Glycated hemoglobin (HbA1c) 6.5% to 9.5% inclusive at screening\n\nPart B\n\n* Have Type 1 Diabetes (T1D) for at least 1 year with a fasting C-peptide level of 0.20 nanomole per liter (nmol/L) or less or non-fasting C-peptide level of 0.30 nmol/L or less at screening\n* HbA1c 6% to 8.5% inclusive at screening\n\nPart C\n\n* Have T1D for at least 1 year with a fasting C-peptide level of 0.20 nanomole per liter (nmol/L) or less or non-fasting C-peptide level of 0.30 nmol/L or less at screening\n* HbA1c 6 to 8% inclusive at screening\n\nAll Parts\n\n* Have blood pressure of less than 140/90 millimeters of mercury (mmHg) for healthy participants or 150/90 mmHg for participants with diabetes and pulse rate of less than 90 beats per minute (bpm) (supine)\n* No hypoglycemia unawareness for all Type 1 and Type 2 Diabetes participants\n\nExclusion Criteria:\n\n* Have had more than 1 emergency room visit or hospitalization due to poor glucose control (hyperglycemia or diabetic ketoacidosis) within 6 months prior to screening\n* Have had any episodes of severe hypoglycemia (defined as requiring assistance due to neurologically disabling hypoglycemia) within the 6 months prior to screening\n\nAll Parts\n\n* Cardiovascular: no significant history of cardiovascular disease (CVD)\n* Gastrointestinal: have gastroparesis or have undergone gastric surgery\n* Hepatic: have acute or chronic hepatitis",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you generally healthy as determined by a medical evaluation?",
        "Have you been diagnosed with type 2 diabetes more than 1 year ago?",
        "Are you currently on basal insulin therapy, insulin glargine, or insulin degludec, more than 10 units per day for at least 6 months?",
        "Is your HbA1c level between 6.5% and 9.5%?",
        "Have you had type 1 diabetes for at least 1 year?",
        "Is your fasting C-peptide level 0.20 nmol/L or less, or non-fasting C-peptide level 0.30 nmol/L or less?",
        "Is your HbA1c level between 6% and 8.5%?",
        "Is your HbA1c level between 6% and 8%?",
        "Is your blood pressure less than 140/90 mmHg if healthy, or less than 150/90 mmHg if you have diabetes?",
        "Is your pulse rate less than 90 beats per minute while resting?",
        "Are you aware when your blood sugar is too low?"
      ],
      "exclusion": [
        "Have you visited the emergency room or been hospitalized due to poor glucose control more than once in the last 6 months?",
        "Have you had any severe low blood sugar episodes requiring assistance in the last 6 months?",
        "Have you had any significant heart disease?",
        "Do you have a condition that affects stomach emptying or have you had stomach surgery?",
        "Have you had acute or chronic hepatitis?"
      ]
    }
  },
  {
    "nct_id": "NCT06473480",
    "title": "Continuous GLUCOse Monitoring System With a SENSor Compared to Fingerstick Glucose Monitoring in Surgical Wards (GLUCOSENS)",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Hospitalized patients (≥ 18 years old) in surgical wards\n* Glucose measurements at least 4 times (OUH) and 3 times (SUH) daily for at least three days, prescribed by surgeon\n* Expected hospitalization for at least three days\n* Communicates in Danish\n* Signed a declaration of consent to study participation\n* At risk of hypo- and hyperglycemia (with or without a diabetes diagnosis)\n* Specific for substudy 4 inclusion criteria as above with the following add on: Patients being treated with insulin at discharge and patients residing within the OUH admission area.\n\nExclusion Criteria:\n\n* Cognitively impaired patients\n* Indication for glucose monitoring solely because of parenteral nutrition treatment\n* Patients admitted with a CGMS\n* Patients from the point-of-care fingerstick capillary glucose monitoring group cannot be included in the continuous glucose monitoring system group\n\nEligibility criteria solely for substudy 7\n\nInclusion Criteria:\n\n* Nursing staff with at least one month of experience with both point-of-care fingerstick capillary glucose monitoring and continuous glucose monitoring system and are registered nurses or certified nursing assistants",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "110 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Are you currently staying in a surgical ward?",
        "Do doctors measure your blood sugar at least 4 times daily?",
        "Will you be in the hospital for at least three more days?",
        "Do you speak Danish?",
        "Are you willing to sign a consent form for this study?",
        "Do you have a risk of low or high blood sugar?",
        "Are you being treated with insulin and live in the OUH area?"
      ],
      "exclusion": [
        "Do you have trouble understanding or remembering things?",
        "Are you only checking blood sugar because of special nutrition treatment?",
        "Did you come to the hospital with a continuous glucose monitoring system?",
        "Have you been using fingerstick glucose monitoring?"
      ]
    }
  },
  {
    "nct_id": "NCT06042153",
    "title": "Semaglutide for Dialysis-Treated Patients - a Glucose Time in Range Study- DIALYSIS-TIR Study",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Ability to provide informed consent before any trial-related activities. Trial-related activities are any procedures that are carried out as a part of trial, including activities to determine suitability for the trial.\n2. Male or female Adults (age \\> 18 years at the time of signing the consent)\n3. Type 2 diabetes mellitus diagnosed \\> 6 months prior to screening\n4. On current chronic treatment with Hemodialysis or Peritoneal dialysis for \\> 6 months prior to screening\n5. Current treatment with any glucose lowering pharmacotherapy, at a stable dose for at least 30 days. DPP-4 Inhibitors will be allowed at study entry and will be stopped at randomization.\n6. Minimum of 80% valid data on the 10-day Continuous Glucose Monitor download\n7. Time in Range 15 to 60%\n\nExclusion Criteria:\n\n1. BMI \\< 23 kg/m2 at screening\n2. Current (within the past 90 days of screening) use of any GLP-1 RA\n3. Personal or family history of medullary thyroid cancer or Multiple Endocrine Neoplasia type 2\n4. Known or suspected hypersensitivity to GLP-1 RA (trial medication(s), excipients, or related products)\n5. Pregnant, breast-feeding or the intention of becoming pregnant, or not using effective contraceptive measures\n6. Active weight loss, defined as weight loss of \\>5% of body weight in the past 3 months\n7. Current participation in other interventional trials or last dose of any investigational product within 4 half- lives at the time of randomization\n8. Any medical condition which in the judgement of the investigator precludes safe participation in the trial (includes, but not limited to active neoplasm, severe heart failure, recent cardiovascular event, severe frailty, planned cardiac or vascular surgeries on the day of screening etc)\n9. If weight loss is not desired by the participant, or if the provider or investigator considers intentional weight loss to be detrimental to the health of the participant\n10. Other or secondary forms of diabetes (like type 1 diabetes, pancreatogenic diabetes mellitus, MODY, LADA, drug induced, etc.)\n11. Current diagnosis of gastroparesis or enteropathywhich in the opinion of investigator precludes safe treatment with GLP-1 RA.\n12. Hypoglycaemia unawareness, or history of frequent or severe hypoglycaemia (in the opinion of the investigator)\n13. Personal history of chronic pancreatitis, or acute pancreatitis within 180 days of screening\n14. Known current uncontrolled or unstable retinopathy (by medical history)",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Can you provide informed consent before any trial-related activities?",
        "Are you 18 years or older?",
        "Have you been diagnosed with type 2 diabetes more than 6 months ago?",
        "Have you been on dialysis treatment for more than 6 months?",
        "Are you currently taking medication to lower your blood sugar?",
        "Have you used a Continuous Glucose Monitor with at least 80% valid data?",
        "Is your Time in Range between 15% and 60%?"
      ],
      "exclusion": [
        "Is your BMI less than 23?",
        "Have you used any GLP-1 medication in the past 90 days?",
        "Do you or your family have a history of medullary thyroid cancer?",
        "Are you allergic to GLP-1 medication?",
        "Are you pregnant, breastfeeding, or planning to become pregnant?",
        "Have you lost more than 5% of your body weight in the past 3 months?",
        "Are you currently participating in another clinical trial?",
        "Do you have any medical condition that might make it unsafe to participate?",
        "Do you not want to lose weight, or is weight loss considered harmful for you?",
        "Do you have any other type of diabetes besides type 2?",
        "Have you been diagnosed with gastroparesis or enteropathy?",
        "Do you often have severe low blood sugar without warning?",
        "Have you had pancreatitis in the past 180 days?",
        "Do you have uncontrolled or unstable eye disease due to diabetes?"
      ]
    }
  },
  {
    "nct_id": "NCT06798181",
    "title": "The Effect of Neuropathic Pain on Self-Care Ability and Quality of Life in Type II Diabetic Patients",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "visual"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* 18 years and older,\n* Diagnosed with type II diabetes,\n* Reading and writing,\n* No physical or psychological communication barriers,\n* Can read and speak Turkish,\n* Volunteers\n\nExclusion Criteria:\n\n* Diagnosed with type I diabetes",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "100 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years or older?",
        "Have you been diagnosed with type II diabetes?",
        "Can you read and write?",
        "Do you have any physical or psychological issues that prevent communication?",
        "Can you read and speak Turkish?",
        "Are you volunteering for this trial?"
      ],
      "exclusion": [
        "Have you been diagnosed with type I diabetes?"
      ]
    }
  },
  {
    "nct_id": "NCT06464900",
    "title": "Effects of a Health Education Intervention Based on the Behaviour Change Wheel on Fear of Hypoglycemia in Patients With Type 2 Diabetes Mellitus: a Randomized Controlled Study",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Comply with the 2020 Chinese guidelines for the prevention and treatment of type 2 diabetes mellitus;\n* Age ≥18 years;\n* Duration of diabetes mellitus ≥1 year;\n* FoH according to the elevated item endorsement criterion (E I criterion): ≥3 points on any item of the Hypoglycemic Fear-Worry Scale (HFS-WS);\n* Patients who have the ability to listen, read, write, walk, and cooperate to complete the study;\n* Patients who have a smart phone, and can skillfully use WeChat or telephone to communicate;\n* Voluntarily participate in this study and sign the informed consent form.\n\nExclusion Criteria:\n\n* Patients with comorbid acute complications or other serious diseases or disorders of consciousness, such as diabetic hypertonic state, tumors, coma, etc;\n* Patients with comorbid psychiatric diseases or taking psychotropic drugs;\n* Patients who have recently or are participating in other studies on similar topics.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Do you follow the 2020 Chinese guidelines for type 2 diabetes care?",
        "Are you 18 years old or older?",
        "Have you had diabetes for at least one year?",
        "Do you often worry about low blood sugar (score of 3 or more)?",
        "Can you listen, read, write, walk, and follow study instructions?",
        "Do you have a smartphone and can use WeChat or a telephone?",
        "Are you willing to join this study and sign a consent form?"
      ],
      "exclusion": [
        "Do you have serious health issues like tumors or coma?",
        "Have you ever been diagnosed with a mental health condition?",
        "Are you currently taking medications for mental health issues?",
        "Are you currently participating in another similar study?"
      ]
    }
  },
  {
    "nct_id": "NCT07172867",
    "title": "A Randomized, Double-Blind, Placebo-Controlled Multicenter Phase 2 Study to Evaluate the Safety, Efficacy and Tolerability of Ofirnoflast (HT-6184) and Semaglutide in Obese or Overweight Participants With Type 2 Diabetes Mellitus (T2DM)",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Participant must be 18 to 65 years of age inclusive, at the time of signing the informed consent.\n* Capable of giving signed informed consent as described in Appendix 1 which includes compliance with the requirements and restrictions listed in the ICF and in this protocol.\n* BMI between 27 kg/m2 and 40 kg/m2.\n* Stable body weight (± 5 kg) within 90 days of screening, and body weight \\<150 kg.\n* HbA1c is 7.5-10.5% at screening.\n* Established diagnosis of T2DM.\n* Receiving a stable 1mg SC q1wk dose of semaglutide (Ozempic®) for ≥ 90 days prior to signing informed consent.\n* Females must meet one of the following:\n\n  1. Postmenopausal (\\>45 years of age with amenorrhea for at least 12 months, without using exogenous hormonal contraception and with FSH ≥ 40 IU/L).\n  2. Surgically sterile (hysterectomy, bilateral salpingectomy; oophorectomy) for at least 6 months.\n  3. Using a double contraception including a barrier method (condom, diaphragm, or occlusive cap) and a highly effective method of birth control, which includes the following:\n\n  i. Established use (i.e. at least 90 days prior to signing of ICF) of combined (estrogen and progestogen) oral, intravaginal, or transdermal hormonal contraceptive associated with inhibition of ovulation ii. Established use (i.e. at least 90 days prior to signing of ICF) of progestogen-only oral, injectable, or implantable hormonal contraceptive associated with inhibition of ovulation iii. Established use (i.e. at least 90 days prior to signing of ICF) of an intrauterine device (IUD) or intrauterine hormone-releasing system (IUS) iv. Bilateral tubal occlusion completed at least 90 days prior to signing of ICF d. Vasectomized partner with the appropriate post-vasectomy documentation of the absence of spermatozoa in the ejaculate. Participant must provide documentation before the first dose of ofirnoflast (study day 1).\n\n  e. Sexual abstinence, when this is in line with the preferred and usual lifestyle of the participant\n* Male participants who are sexually active with a woman of childbearing potential must agree to use a double contraception including a barrier method (male condom) and a highly effective method of contraception (highly effective methods of contraception are listed above) during the study and for 30 days after the last dose of ofirnoflast/ placebo.\n* In the case of WOCBP, participants must have a negative serum pregnancy test (β-human chorionic gonadotropin \\[β-hCG\\]) at screening and negative urine pregnancy tests on first day of dosing and at each study visit.\n* Able to comply with the study procedures in the view of the Investigator.\n\nExclusion Criteria:\n\n* Any prescription or over-the-counter medications intended for weight loss within 6 months of screening, excluding semaglutide.\n* History of, or known hypersensitivity to, monoclonal antibody drugs or a contraindication to semaglutide (e.g. Ozempic® or Wegovy®)\n* Use of other investigational drugs at the time of screening or within 30 days or 5 half-lives prior to signing of the ICF, whichever is longer, or longer if required by local regulations\n* Previous or current diagnosis of Type 1 diabetes mellitus (T1DM) or current gestational diabetes.\n* Diagnosis of T2DM requiring current use of insulin, repaglinide, saxagliptin, and sulfonylureas.\n\nNote. Use of Metformin for the purposes of glycemic control is not exclusionary.\n\n* History of diabetic ketoacidosis (within 90 days of screening), or proliferative or severe retinopathy (i.e., retinopathy requiring acute treatment).\n* Previous bariatric surgery, liposuction, or planned weight loss surgery.\n* Current or past diagnosis of pancreatitis\n* Current or past diagnosis of severe gastroparesis\n* Personal or within first-degree relative family history of medullary thyroid cancer or multiple endocrine neoplasia type 2\n* Calcitonin ≥20 ng/L measured by central laboratory at screening (individuals with elevated calcitonin at initial screening may be re-screened)\n* Laboratory abnormalities at screening\n* Current or history of clinically significant (per Investigator's judgment) liver or biliary disease or significantly abnormal LFT at screening (see above)\n* Current acute or chronic self-reported HCV and/or HBV infection\n* Current or history of clinically significant renal disease (per Investigator's judgment) or eGFR\\<60mL/min/1.73m2\n* Prior history of malignancy (including breast cancer, lymphoma, leukemia) within the past 5 years except for cervical carcinoma in situ that has been completely resected with no evidence of recurrence or metastatic disease for at least 12 months or cured basal cell carcinoma with no evidence of recurrence for at least 12 months.\n* History of a major organ transplant (e.g. kidney, heart, liver, lung) or hematopoietic stem cell/ bone marrow transplant.\n* History of lymphoproliferative disease or signs/ symptoms suggestive of possible lymphoproliferative disease, including splenomegaly of lymphadenopathy.\n* History or current moderate to severe congestive heart failure (New York Heart Association class III or IV), or within the last 6 months, a cerebrovascular accident, myocardial infarction, unstable angina, unstable arrhythmia or any other cardiovascular condition which, in the opinion of the Investigator, would put the participant at risk by participation in the study.\n* Undergone any major surgery within 8 weeks prior to study entry or will require major surgery during the study that, in the opinion of the Investigator, would pose an unacceptable risk to the participant.\n* Planning elective surgery during the study duration\n* Inherited or acquired thrombophilia and/ or current or history of thromboembolic events/ disease.\n* Screening 12-lead ECG that demonstrates relevant abnormalities that, in the opinion of the Investigator, are clinically significant and indicate an unacceptable risk for the participant's participation in the study (e.g., QTc \\>450 msec or a QRS interval \\>120 msec). If QTc exceeds 450 msec, or QRS exceeds 120 msec, the ECG should be repeated two more times and the average of the three QTc or QRS values should be used to determine the participant's eligibility.\n* History or evidence of any other clinically significant concomitant disorder, condition or disease that, according to the Investigator's and medical monitor's (if consulted) judgment, would pose a risk to participant safety or interfere with the study evaluation, procedures, completion or interpretation of data\n* Pregnant or breast-feeding.\n* Blood donation within the last month before study day 1 (first dose of ofirnoflast or placebo)",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "65 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 65 years old?",
        "Can you give signed informed consent and follow the study rules?",
        "Is your BMI between 27 and 40?",
        "Has your body weight been stable (± 5 kg) for the past 90 days?",
        "Is your body weight less than 150 kg?",
        "Is your HbA1c between 7.5% and 10.5%?",
        "Have you been diagnosed with type 2 diabetes?",
        "Have you been taking a stable 1mg dose of semaglutide (Ozempic®) for at least 90 days?",
        "Are you postmenopausal, surgically sterile, or using double contraception?",
        "If you are a female, have you had a negative pregnancy test at screening?",
        "Are you able to follow the study procedures?"
      ],
      "exclusion": [
        "Have you taken any weight loss medications in the past 6 months?",
        "Are you allergic to monoclonal antibody drugs or semaglutide?",
        "Are you currently using other investigational drugs?",
        "Have you been diagnosed with type 1 diabetes or gestational diabetes?",
        "Do you currently use insulin, repaglinide, saxagliptin, or sulfonylureas for diabetes?",
        "Have you had diabetic ketoacidosis or severe retinopathy in the past 90 days?",
        "Have you had bariatric surgery, liposuction, or planned weight loss surgery?",
        "Have you been diagnosed with pancreatitis?",
        "Have you been diagnosed with severe gastroparesis?",
        "Do you or a close family member have a history of medullary thyroid cancer?",
        "Have you had a major organ transplant or stem cell transplant?",
        "Have you had moderate to severe heart failure or a recent heart attack?",
        "Have you had major surgery in the past 8 weeks or plan to have surgery?",
        "Have you been diagnosed with a blood clotting disorder or had blood clots?",
        "Have you had any other significant medical condition that could pose a risk?",
        "Are you pregnant or breastfeeding?",
        "Have you donated blood in the last month?"
      ]
    }
  },
  {
    "nct_id": "NCT03811470",
    "title": "China Diabetes Registry - a Prospective Cohort Study of Patients With Diabetes in National Metabolic Management Centers in China",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Main Inclusion Criteria:\n\n* Age ≥ 18 years old\n* Diagnosis of diabetes mellitus based on self-reported history of diagnosed diabetes by clinicians or in line with the current domestic diagnostic criteria for diabetes\n* Gender: males and females\n* Provide written informed consent\n* Satisfactory compliance\n\nMain Exclusion Criteria:\n\n* Patients with significantly reduced life expectancy (less than 5 years)\n* With Drug abuse\n* With AIDS or syphilis or infectious diseases such as viral hepatitis or tuberculosis in active phase at enrollment",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 18 years old or older?",
        "Have you been diagnosed with diabetes by a doctor?",
        "Are you male or female?",
        "Are you willing to provide written informed consent?",
        "Can you follow the study instructions and attend visits as required?"
      ],
      "exclusion": [
        "Have you been told your life expectancy is less than 5 years?",
        "Have you ever had a problem with drug abuse?",
        "Do you have AIDS, syphilis, active viral hepatitis, or active tuberculosis?"
      ]
    }
  },
  {
    "nct_id": "NCT05404061",
    "title": "Why do Some Patients Respond Better Than Others to Bariatric Surgery?",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Aged 18 -70 years.\n* Male or female.\n* Previous bariatric surgery for obesity and/or diabetes (studies 1 and 2).\n* ≥1 year interval after bariatric surgery (studies 1 and 2).\n* Awaiting bariatric surgery at the Imperial Weight Centre (study 3)\n* Able to give informed consent.\n\nExclusion Criteria:\n\n* History of any medical, psychological or other condition, or use of any medications, including over-the-counter products, which, in the opinion of the investigators, would either interfere with the study or potentially cause harm to the volunteer.\n* Without access at home to a telephone or other factor likely to interfere with ability to participate reliably in the study.\n* Pregnancy or breastfeeding.\n* Unable to maintain adequate contraception for the duration of the study and for one month afterwards.\n* History of hypersensitivity to any of the components of the subcutaneous infusions.\n* Donated blood during the preceding 3 months or intention to do so before the end of the study.\n* Any other co-morbidity that would compromise the validity of the study or the safety of the participant such as heart failure or clinically apparent cardiovascular disease.\n* Anatomical or endocrinological pathology causing poor weight loss or weight regain\n* Uncontrolled hypertension (systolic blood pressure of 160 mmHg or above and/or diastolic blood pressure of 100 mmHg or above)\n* Participation in a research study within the last two months.\n* Unable to speak English (this is relevant to answering the psychological questionnaires)",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "70 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 70 years old?",
        "Have you had bariatric surgery for obesity and/or diabetes before?",
        "Has it been at least 1 year since your bariatric surgery?",
        "Are you waiting for bariatric surgery at the Imperial Weight Centre?",
        "Can you give informed consent?"
      ],
      "exclusion": [
        "Do you have any medical or psychological condition that could interfere with the study?",
        "Do you take any medications that could cause harm or interfere with the study?",
        "Do you have access to a telephone at home?",
        "Are you pregnant or breastfeeding?",
        "Can you use adequate contraception for the duration of the study and one month after?",
        "Do you have any allergies to components of subcutaneous infusions?",
        "Have you donated blood in the last 3 months?",
        "Do you plan to donate blood before the end of the study?",
        "Do you have heart failure or apparent cardiovascular disease?",
        "Do you have any anatomical or endocrinological issues causing poor weight loss?",
        "Do you have uncontrolled high blood pressure (160/100 mmHg or above)?",
        "Have you participated in a research study in the last two months?",
        "Can you speak English?"
      ]
    }
  },
  {
    "nct_id": "NCT07048717",
    "title": "The Mauritius and Rodrigues Non-Communicable Disease (NCD) Study",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 2,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "In short:\n\nInclusion\n\n* Men and women\n* Randomly selected population-based samples (details see below)\n* Target age from 25 to 74 years Exclusion\n* Not living in the study area\n* Age outside the age-range\n\nIn detail:\n\nInclusion Criteria In 1987, 10 randomly selected (with probability proportional to size) population clusters and a purposely selected area of Chinatown in the capital, Port Louis, were surveyed (age range 25-74), and all eligible residents were invited to participate.2 In 1992 and 1998, the same clusters were resurveyed as well as an additional three clusters selected to assess if trends in disease and risk factor distribution observed in the study cohort also occurred in independent clusters (age range 25 years and older). In 1998, the Chinatown cluster was not surveyed. Altogether, 9,559 individuals participated in the first three surveys and 60% of participants took part in more than one survey.\n\nIn 2004, a new study was performed, with similar methodology. In 2009, nine index clusters were chosen with one randomly selected from each of the nine districts in Mauritius. Then, two neighbouring clusters were chosen surrounding the index cluster to form a \"super cluster.\" From this super cluster, one in three households was randomly selected and one adult per household was invited to participate.5 The same methodology was used in 2015 and in 2021 with new randomly chosen clusters forming \"super cluster\" as in 2009. In addition, a random sample from the 1998 survey was invited for a resurvey in 2015.\n\nParticipation rate has been over 85% in each survey. No sampling weights were used.\n\nSame methodology was used in Rodrigues.\n\nExclusion Criteria Outside age-range and not being randomly selected.",
      "sex": "ALL",
      "minimum_age": "25 Years",
      "maximum_age": "74 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you a man or a woman?",
        "Are you between 25 and 74 years old?",
        "Were you randomly selected to participate in this study?",
        "Do you live in the study area?"
      ],
      "exclusion": [
        "Do you live outside the study area?",
        "Are you younger than 25 or older than 74 years old?"
      ]
    }
  },
  {
    "nct_id": "NCT06896799",
    "title": "Determining the Effect of Food Ordering on Blood Glucose In Gestational Diabetes Mellitus (DEFI-GDM) - a Randomised Crossover Study",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Pregnant women with gestational diabetes mellitus\n* Aged 18-50 years old\n\nExclusion Criteria:\n\n* History of type 1 or type 2 diabetes mellitus\n* Dietary restrictions or clinically confirmed food allergies that may affect study requirements\n* Pharmacologically managed GDM at the point of study entry\n* Hyperemesis gravidarum at the point of study entry (i.e. prolonged/severe nausea and vomiting)\n* Using antiemetic medication (e.g. dimenhydrinate, prochlorperazine, promethazine)\n* Any other problems or medical conditions that would substantially limit their ability to complete the study requirements\n\nParticipants can be recruited onto the study if they have previously had GDM in another pregnancy. Participants can also be recruited if they are involved in other research studies, but this will depend on the study type and the decision will be made by the Chief/Principal Investigator.",
      "sex": "FEMALE",
      "minimum_age": "18 Years",
      "maximum_age": "50 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you pregnant?",
        "Have you been diagnosed with gestational diabetes during this pregnancy?",
        "Are you between 18 and 50 years old?"
      ],
      "exclusion": [
        "Have you ever been diagnosed with type 1 or type 2 diabetes?",
        "Do you have any dietary restrictions or food allergies?",
        "Are you currently taking medication to manage gestational diabetes?",
        "Have you experienced prolonged or severe nausea and vomiting during this pregnancy?",
        "Are you currently taking medication to prevent nausea or vomiting?",
        "Do you have any other medical conditions that might prevent you from completing the study?"
      ]
    }
  },
  {
    "nct_id": "NCT05855863",
    "title": "Clinical Study of Ginkgo Biloba Ketone Ester Tablets in Diabetes Related Dementia",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Type 2 diabetes with mild cognitive impairment patients aged 65 years or above;\n2. Able to cooperate in completing cognitive function testing;\n3. Patients who can swallow pills\n4. No previous history of stroke，cerebral thrombosis, etc\n\nExclusion Criteria:\n\n1. Type 1 diabetes;\n2. Acute cerebral infarction and myocardial infarction within 3 months;\n3. Severe liver and kidney dysfunction;\n4. Late stage malignant tumors;\n5. Thyroid dysfunction；\n6. Brain injury and cerebral hemorrhage within 3 months；\n7. Folic acid and/or vitamin B12 deficiency\n8. Patients who are currently using thrombin inhibitors, defibrillators (with unclear efficacy in ischemic stroke and increased risk of bleeding), antiplatelet drugs, blood activating and stasis resolving agents, and other ginkgo biloba leaf preparations (as they may affect the evaluation of the therapeutic effect of ginkgo biloba ester tablets in this trial), as well as other trial medications.",
      "sex": "ALL",
      "minimum_age": "60 Years",
      "maximum_age": "90 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you 65 years or older?",
        "Do you have type 2 diabetes?",
        "Have you noticed any mild memory problems?",
        "Can you cooperate to complete some cognitive tests?",
        "Can you swallow pills?"
      ],
      "exclusion": [
        "Do you have type 1 diabetes?",
        "Have you had a stroke or brain blood clot?",
        "Have you had a heart attack or brain issue in the last 3 months?",
        "Do you have severe liver or kidney problems?",
        "Have you been diagnosed with a late-stage cancer?",
        "Do you have thyroid problems?",
        "Have you had a brain injury or brain bleed in the last 3 months?",
        "Have you been diagnosed with low folic acid or vitamin B12?",
        "Are you currently taking blood thinners or other ginkgo biloba medications?"
      ]
    }
  },
  {
    "nct_id": "NCT04416269",
    "title": "Use of Oral Antidiabetic Agents in Hospitalized Patients With Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Males or females, age 18-80 years admitted to a general medicine and surgery services\n* Known history of T2D receiving OADs either as monotherapy or in combination therapy\n* Admission BG \\< 250 mg/dl or randomization BG \\<250 mg/dl and not receiving basal insulin\n* Patients receiving OADs in combination with GLP-1 receptor agonists (GLP-1RA) who have HbA1c \\<7.5% within the past three months\n* HbA1c \\<10%\n\nExclusion Criteria:\n\n* No known history of diabetes\n* Laboratory evidence of diabetic ketoacidosis\n* Subjects with a history of type 1 diabetes (suggested by BMI \\< 25 requiring insulin therapy or with a history of diabetic ketoacidosis, or ketonuria)\n* Meeting any exclusion criteria based on specific contraindications to their home oral therapy\n* Acute critical illness or cardiac surgery expected to require admission to a critical care unit\n* Gastrointestinal obstruction, adynamic ileus, or expected to require gastrointestinal suction\n* Medical or surgical patients expected to be kept NPO for \\>24-48 hours after admission or after completion of surgical procedure\n* Impaired renal function (eGFR \\<30 ml/min)\n* Current treatment with oral or injectable corticosteroid\n* Mental condition rendering the subject unable to understand the nature and scope of the study\n* Female subjects who are pregnant or breastfeeding at time of enrollment in the study\n* New or recent onset (within two weeks) of coronavirus disease 2019 (COVID-19) infection at the time of admission",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "80 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 80 years old?",
        "Are you admitted to a general medicine or surgery service?",
        "Have you been diagnosed with type 2 diabetes?",
        "Are you currently taking diabetes pills?",
        "Is your blood sugar level less than 250 mg/dl at admission or randomization?",
        "Are you taking diabetes pills without basal insulin?",
        "Are you taking diabetes pills with GLP-1 receptor agonists and have HbA1c less than 7.5%?",
        "Is your HbA1c less than 10%?"
      ],
      "exclusion": [
        "Have you never been diagnosed with diabetes?",
        "Have you been diagnosed with diabetic ketoacidosis?",
        "Have you been diagnosed with type 1 diabetes?",
        "Do you have any conditions that make your diabetes pills unsafe?",
        "Are you critically ill or expected to need intensive care?",
        "Do you have a gastrointestinal obstruction or ileus?",
        "Are you expected to be kept NPO (no food or drink) for more than 24-48 hours?",
        "Do you have severe kidney problems?",
        "Are you currently taking steroids?",
        "Do you have a mental condition that makes it hard to understand the study?",
        "Are you pregnant or breastfeeding?",
        "Have you been diagnosed with COVID-19 in the last two weeks?"
      ]
    }
  },
  {
    "nct_id": "NCT06180837",
    "title": "Biomarkers of Habitual Short Sleep and Related Cardiometabolic Risk",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Age: 18-45 years old; equal numbers of men and women\n2. Body mass index (BMI): 27.5-34.9 kg/m2\n3. Sleep Habits: habitual self-reported average total sleep time (TST) \\<6.5 hours per night for prior 6 months\n\nExclusion Criteria:\n\n1. Clinically diagnosed sleep disorder or major psychiatric illness\n2. Evidence of significant organ dysfunction or disease (e.g., heart disease, kidney disease)\n3. Clinically diagnosed diabetes or fasting plasma glucose ≥126 mg/dL or HbA1c ≥6.5%\n4. Use of prescription drugs or substances known to influence sleep or glucose metabolism, or anticoagulant medications.\n5. Cancer that has been in remission less than 5 years\n6. Pregnant/nursing, experiencing menopause or post-menopausal\n7. Shift-work: current or history of within last year\n8. Weight change: \\>10% of body weight over prior six months\n9. Current enrollment in weight loss or physical activity program like the Diabetes Prevention Program\n10. Currently smoking\n11. Alcohol intake\\>14 drinks per week or \\>3 drinks per day",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "45 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 45 years old?",
        "Is your body mass index (BMI) between 27.5 and 34.9?",
        "Do you usually sleep less than 6.5 hours per night on average?"
      ],
      "exclusion": [
        "Have you been diagnosed with a sleep disorder or a major psychiatric illness?",
        "Do you have any serious organ problems like heart or kidney disease?",
        "Have you been diagnosed with diabetes or have high blood sugar levels?",
        "Are you taking any prescription drugs that affect sleep or blood sugar?",
        "Have you had cancer that has been in remission for less than 5 years?",
        "Are you pregnant, nursing, or experiencing menopause?",
        "Do you currently work shifts or have you done so in the last year?",
        "Have you lost or gained more than 10% of your body weight in the last six months?",
        "Are you currently in a weight loss or physical activity program?",
        "Do you currently smoke?",
        "Do you drink more than 14 alcoholic drinks per week or more than 3 drinks per day?"
      ]
    }
  },
  {
    "nct_id": "NCT06675994",
    "title": "Evaluation of PCSK9 Enzyme in Non-Cholesterol Biological Pathways: In Vitro Demonstration of Direct Platelet-Related Effects of PCSK9 Enzyme",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "urinary"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Healthy subjects (n=40): 18-50 years old male and female subjects without any conditions or taking any agents or food supplements that may influence platelet function as determined by the study principal investigator.\n* Subjects with CV risk factors (n=40): 18-50 years old male and female subjects with at least three of the following CV risk factors:\n\nHistory of hypercholesterolemia, hypertension, overweight, current smoker, prediabetes or diabetes who are only on metformin and insulin, and family history of coronary artery, peripheral artery, or cerebrovascular disease.\n\nOverweight is defined as subjects with BMI ≥25 kg/m2 (https://www.heart.org/en/healthy-living/healthy-eating/losing-weight/bmi-in-adults).\n\nDiabetes is defined as haemoglobin (Hb)A1c ≥6.5%, prediabetes =5.7%-6.4%) (https://diabetes.org/about-diabetes/diagnosis)\n\nExclusion Criteria:\n\n* Subjects with Diabetes mellitus, who are on GLP-1 agonists or SGLT2 inhibitors.\n* Subjects on high dose statin therapy or PCSK9 therapy.\n* Prior coronary of cerebrovascular event requiring intervention.\n* Use of any antiplatelet or anticoagulant therapy within 14 days of enrollment.\n* Subjects with a history of chronic kidney disease, liver disease, pancreatitis, HIV, hepatitis, and active cancer, active infection, or any other medical condition or concomitant medications as determined by the investigator that may affect study results.\n* Pregnant",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "50 Years",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 50 years old?",
        "Are you generally healthy without conditions affecting platelet function?",
        "Do you have a history of high cholesterol?",
        "Do you have a history of high blood pressure?",
        "Is your BMI 25 or higher?",
        "Are you a current smoker?",
        "Do you have prediabetes or diabetes and only take metformin or insulin?",
        "Does your family have a history of heart, artery, or stroke diseases?",
        "Have you been diagnosed with prediabetes?",
        "Have you been diagnosed with diabetes?"
      ],
      "exclusion": [
        "Are you taking GLP-1 agonists or SGLT2 inhibitors for diabetes?",
        "Are you on high dose cholesterol-lowering medication or PCSK9 therapy?",
        "Have you had a heart or stroke event requiring medical intervention?",
        "Have you taken any blood-thinning medication in the last 14 days?",
        "Do you have a history of chronic kidney disease?",
        "Do you have a history of liver disease?",
        "Have you ever been diagnosed with pancreatitis?",
        "Have you been diagnosed with HIV or hepatitis?",
        "Do you have active cancer?",
        "Do you have an active infection?",
        "Do you have any other medical condition that may affect the study results?",
        "Are you pregnant?"
      ]
    }
  },
  {
    "nct_id": "NCT06545227",
    "title": "An Observational Nested Multicenter Cohort Study of Early Versus Late Monitoring Among Pregnant Women With a History of Gestational Diabetes",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n1. Age \\>16\n2. Pregnant\n3. Previous pregnancy with gestational diabetes diagnosed by an Oral Glucose Tolerance Test\n4. Singleton pregnancy\n\nExclusion Criteria:\n\nWomen with the following risk factors will be excluded:\n\n1. Multiple pregnancy\n2. History of bariatric surgery\n3. Taking metformin or other oral hypoglycaemic agents\n4. HbA1c more than or equal to 48",
      "sex": "FEMALE",
      "minimum_age": "17 Years",
      "maximum_age": "45 Years",
      "healthy_volunteers": "N/A"
    },
    "questions": {
      "inclusion": [
        "Are you older than 16?",
        "Are you pregnant?",
        "Were you diagnosed with gestational diabetes in a previous pregnancy?",
        "Is this a single baby pregnancy?"
      ],
      "exclusion": [
        "Are you pregnant with more than one baby?",
        "Have you ever had weight loss surgery?",
        "Are you taking metformin or other pills to lower your blood sugar?",
        "Has a blood test shown your HbA1c is 48 or higher?"
      ]
    }
  },
  {
    "nct_id": "NCT07045298",
    "title": "Real-Time Continuous Glucose Monitoring for the Management of Patients With Type 2 Diabetes and Acutely Decompensated Heart Failure",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria:\n\n* Adults 18 to 90 years admitted with a diagnosis of acute decompensated heart failure (ADHF), New York Heart Association (NYHA) class II, III, or IV symptoms (Aim 1) and discharged with a clinical diagnosis of ADHF (Aim 2).\n* Patients with diabetes treated with diet alone or oral antidiabetic agents, Glucagon-like peptide-1 receptor agonists (GLP1-RAs), or insulin after discharge\n\nExclusion Criteria:\n\n* Age \\< 18 or \\> 90 years;\n* Patients with a history of type 1 diabetes;\n* Mental condition rendering the subject unable to understand the nature, scope, and possible consequences of the study;\n* Patients on ventricular assist devices;\n* History of a heart transplant or listed for a heart transplant;\n* History of cardiac surgery (within 90 days before enrollment) or planned cardiac interventions within the following 6 months;\n* Female participants who are pregnant or breastfeeding at the time of enrollment into the study;\n* Hospice care or expected life expectancy of less than 6 months;\n* Patients who are expected to require Magnetic Resonance Imaging (MRI) procedures during hospitalization or after discharge.",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "90 Years",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you between 18 and 90 years old?",
        "Were you admitted to the hospital with severe heart failure symptoms?",
        "Do you have symptoms like shortness of breath or fatigue during daily activities?",
        "Were you sent home with a diagnosis of severe heart failure?",
        "Do you manage your diabetes with diet alone?",
        "Do you take pills to control your diabetes?",
        "Do you use insulin or other injectable medications for your diabetes?"
      ],
      "exclusion": [
        "Are you younger than 18 or older than 90 years old?",
        "Have you ever been diagnosed with type 1 diabetes?",
        "Do you have any mental health conditions that make it hard to understand this study?",
        "Do you have a device to help your heart pump blood?",
        "Have you ever had a heart transplant or are you waiting for one?",
        "Have you had heart surgery in the last 3 months?",
        "Do you have any heart procedures planned in the next 6 months?",
        "Are you pregnant or breastfeeding?",
        "Are you currently in hospice care?",
        "Do you expect to need an MRI scan while in the hospital or after going home?"
      ]
    }
  },
  {
    "nct_id": "NCT06297239",
    "title": "Argentine Registry for the Study of Lipoprotein a",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "type 2"
      ]
    },
    "eligibility": {
      "criteria": "Inclusion Criteria: Adult patients with validated Lp(a) values -\n\nExclusion Criteria: Associated pathologies that can increase the Lp(a) value in a non-specific manner\n\n\\-",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": false
    },
    "questions": {
      "inclusion": [
        "Are you an adult?",
        "Have you had your Lp(a) values checked by a doctor?"
      ],
      "exclusion": [
        "Do you have any other illnesses that can increase Lp(a) levels?"
      ]
    }
  },
  {
    "nct_id": "NCT03922932",
    "title": "Wide-Field and Projection-Resolved Optical Coherence Tomography Angiography in Diabetic Retinopathy",
    "relevance_score": {
      "num_keywords": 1,
      "total_occurrences": 1,
      "keywords_found": [
        "eye"
      ]
    },
    "eligibility": {
      "criteria": "Participant-Related Inclusion Criteria:\n\nI. All Diabetics (Groups A, B, C)\n\n* Type 1 diabetes of at least 5 years duration or\n* Type 2 diabetes of any duration II. Group B\n* Able to return for follow-up over 3 years\n\nParticipant-Related Exclusion Criteria:\n\nI. Group B\n\n* Significant medical condition that would make long-term follow-up difficult II. Controls (Group D)\n* Any medical problems associated with retinal vascular abnormalities (i.e., hypertension, systemic vasculitis, carotid insufficiency, etc.)\n\nEye-Related Inclusion Criteria:\n\nI. Group A:\n\n* Presence of active neovascularization, with or without prior treatment\n* Presence of involuted fibrovascular proliferans\n\nII. Group B:\n\n* NPDR of any severity as defined by the International Clinical Diabetic Retinopathy Severity Scale\n\nIII. Groups C \\& D:\n\n* No evidence of diabetic retinopathy\n\nIV. Group ME:\n\n* Presence of center-involving macular edema requiring treatment\n\nEye-Related Exclusion Criteria: (Applies to study eye only. May be present in non-study eye.)\n\n* Visual acuity worse than 20/200\n* Inability to maintain stable fixation for OCT imaging\n* History of major eye surgery (vitrectomy, cataract surgery, scleral buckle, other intraocular surgery, etc.) within 90 days of enrollment\n* History of another eye disease or condition that may alter retinal perfusion, permeability, or retinal anatomy\n* Substantial media opacity (cataract, corneal scar, vitreous hemorrhage) that may interfere with study imaging",
      "sex": "ALL",
      "minimum_age": "18 Years",
      "maximum_age": "N/A",
      "healthy_volunteers": true
    },
    "questions": {
      "inclusion": [
        "Have you had type 1 diabetes for at least 5 years?",
        "Have you been diagnosed with type 2 diabetes?",
        "Can you return for follow-up visits over the next 3 years?",
        "Do you have active growth of new blood vessels in your eyes?",
        "Have you had shrunk abnormal blood vessels in your eyes?",
        "Do you have non-proliferative diabetic retinopathy?",
        "Do you have no signs of diabetic retinopathy?",
        "Do you have swelling in the center of your retina that needs treatment?"
      ],
      "exclusion": [
        "Do you have a serious medical condition that makes long-term follow-up difficult?",
        "Do you have any medical problems related to blood vessel abnormalities in the retina?",
        "Is your vision worse than 20/200 in the eye being studied?",
        "Do you have trouble keeping your eye still for imaging?",
        "Have you had major eye surgery in the last 90 days?",
        "Do you have another eye disease that affects blood flow or structure of the retina?",
        "Do you have cloudiness in your eye (like cataract or corneal scar) that affects imaging?"
      ]
    }
  }
]